{
  "bluevideo": "/images/4.things_you_can_do_from_our_portal.mp4",
  "s3TopText": "AAA is more than a delivery service; we are a business enabler dedicated to your success. Our primary objectives are customer satisfaction, reliability, and on-time deliveries. With our custom one-to-one approach, we ensure timely deliveries every time. We strive to become your trusted business partner, delivering what matters most to you. Here’s what we offer:",
  "top-image": "/images/aaadeliveryservice-final-v2.mp4",
  "blueTitleLeft": "Medical Laboratories",
  "s4bluetoptext": "We are available 24/7—any time of day, weekends, and holidays. No matter when you need us, our team is ready to ensure your deliveries are never delayed. At AAA, we don’t just deliver packages—we deliver peace of mind. [Contact us today](/speak-to-a-specialist) and let's redefine your medical logistics experience.",
  "blueTopText": "Once you're in our system, you’re ready to go. Easily schedule and track orders from any device, anytime. Gain full visibility with real-time tracking, custom alerts, and delivery confirmations — all from one central dashboard.",
  "brimage": "/images/speak3.png",
  "blimage": "/images/speak1.png",
  "bottomsmtext": "Guaranteed On-Time Delivery! No Excuses!",
  "blueTitleCenter": "Hospitals & Health Systems",
  "s3c2img": "/images/home7.png",
  "subtitle": "Please provide us with some basic information so we can learn more about your business delivery requirements, enabling our logistics specialists to create a tailored solution that meets your specific needs.\n\n\\n\n\nPlease fill out the form on the right with the requested information. One of our logistics specialists will review your information and contact you shortly to discuss the next steps and answer any questions you may have.",
  "s3BottomText": "# Delivering Peace of Mind with AAA\n\nOur mission is to provide unmatched reliability, professionalism, and peace of mind with every delivery. We handle your logistics with precision and care, so you can focus on what matters most—your core business. With AAA, your deliveries are always in trusted hands.",
  "title": "Ready To Speak To A Specialist?",
  "s3r2content1": "* Flexible Solutions That Adapt to Your Business\n* Peace of Mind, Every Mile — Backed by Reliable, Consistent Service\n* HIPAA, OSHA, TSA & FMCSA Compliant\n* Customizable Notifications and Delivery Preferences\n* User-Friendly Online Portal with Full Visibility and Control",
  "bcimage": "/images/home1.png",
  "topsmtext": "What You Can Expect From Us",
  "s3topsmtext": "Why Choose AAA?",
  "s3l2content1": "* Guaranteed On-Time Delivery — No Excuses\n* Same-Day, On-Demand, and Scheduled Route Services\n* Couriers are Uniformed, Vetted, and Professionally Trained\n* 24/7 Customer Support — Weekends & Holidays Included\n* Real-Time GPS Tracking & Transparent Communication",
  "blueTitle": "   What You Can Do in the Portal:",
  "blueTitleRight": "Pharmacies",
  "blueContent": "1. Place and manage deliveries from a single hub\n2. Schedule and customize pickups\n3. Track orders on a live GPS map\n4. View photo or signature-based PODs\n5. Customize delivery notifications\n6. Maintain a private address book\n7. Generate and print reports on delivery history\n8. Use EZ-Ship shortcuts to save time"
}