{
  "bluevideo": "/images/4.things_you_can_do_from_our_portal.mp4",
  "s3TopText": "AAA is more than a delivery service. We are a business enabler, with our primary objectives being customer satisfaction, reliability, and on-time deliveries. Our custom one-to-one approach ensures we always deliver on time, every time. We will become your trusted business partner, delivering the things that matter most. We provide you with:",
  "top-image": "/images/aaadeliveryservice-final-v2.mp4",
  "blueTitleLeft": "Medical Laboratories",
  "s4bluetoptext": "We are always available 24/7 at any time of the day, during weekends, and all holidays. No matter when, our team of specialists are always available to assist you, ensuring your urgent medical deliveries are never delayed. At AAA, we don't just deliver packages; we deliver peace of mind.  [Contact us today, ](/speak-to-a-specialist)and let's redefine your medical logistics together.",
  "blueTopText": "Once you’re in our system, you are ready to start. Simply place and track orders all in one place. Schedule and customize a pickup from anywhere, using any device. Enjoy visibility and insights with order tracking and geofencing in a real-time dashboard. Signature or photo-based PODs (Proof of Delivery) are provided for each order, along with the scheduled and actual arrival times.",
  "brimage": "/images/speak3.png",
  "blimage": "/images/speak1.png",
  "bottomsmtext": "Guaranteed On-Time Delivery! No Excuses!",
  "blueTitleCenter": "Hospitals & Health Systems",
  "s3c2img": "/images/home7.png",
  "subtitle": "Please provide us with some basic information so we can learn more about your business delivery requirements, enabling our logistics specialists to create a tailored solution that meets your specific needs.\n\n\\n\n\nPlease fill out the form on the right with the requested information. One of our logistics specialists will review your information and contact you shortly to discuss the next steps and answer any questions you may have.",
  "s3BottomText": "# Delivering Peace of Mind with AAA\n\nOur goal is to provide our customers with the utmost reliability, dependability, and professionalism on every delivery, allowing you to focus on your core business. Rest assured, your deliveries are in good hands with AAA.",
  "title": "Ready To Speak To A Specialist?",
  "s3r2content1": "* Customer support around the clock 24/7\n* Transparency and Visibility into Every Single Shipment\n* Order tracking & geofencing in real-time dashboard\n* Custom notification of package delivery status, based on your preference\n* Custom Logistics to Fit and Adapt to Your Business",
  "bcimage": "/images/home1.png",
  "topsmtext": "What You Can Expect From Us",
  "s3topsmtext": "Why Choose AAA?",
  "s3l2content1": "* Guaranteed On-Time Delivery! No Excuses!\n* On-Demand, and Express Same-Day Door-to-Door Delivery\n* Reliability, availability, and professionalism on every delivery\n* Dependable Service You Can Always Count On, ensuring peace of mind\n* Dedicated, fully vetted couriers in uniform, providing secure and efficient deliveries",
  "blueTitle": "   Things You Can Do From Our Portal:",
  "blueTitleRight": "Pharmacies",
  "blueContent": "1. Place and track orders all from one central hub.\n2. Schedule and customize any pickup.\n3. Gain visibility and insights.\n4. View order tracking in real-time, on a live map.\n5. View signature or photo-base PODs for each order.\n6. Create and maintain a private address book.\n7. View, customize and print reports of your shipping history.\n8. Create EZ-ship commands, enabling you to ship instantly with just a couple of keystrokes.\n9. Customize how you are notified of package delivery status."
}