{
  "title": "SMS Terms",
  "subtitle": "AAA Delivery Service – SMS Terms",
  "p1": "",
  "p2": "### **Required SMS Terms Disclosure (10DLC Compliance)**\n\nBy providing your phone number and opting in, you agree to receive operational SMS messages from **AAA Delivery Service**. Message types include route assignments, scheduling updates, delivery confirmations, troubleshooting alerts, safety notifications, and dispatch coordination. **Message frequency varies based on operational needs. Message and data rates may apply.**\n\n* To unsubscribe from SMS messages at any time, reply **STOP**. \n* For assistance, reply **HELP**.\n* For information on how your data is handled, please review our Privacy Policy at: <https://aaadeliveryservice.com/privacy>\n\n\n**Last Updated**: November 2025\n\nAAA Delivery Service, LLC (“AAA Delivery Service,” “we,” “our,” or “us”) provides SMS/text message communications (“SMS”) strictly for internal operational purposes. These messages are sent only to employees and independent contractor drivers who have provided consent during the onboarding or application process.\n\n## **Message Purpose**\n\nMessages are used solely for operational and dispatch-related purposes, including:\n\n* Route assignments and scheduling updates\n* Delivery confirmations and troubleshooting\n* Safety notifications\n* Dispatch coordination\n* Time-sensitive operational alerts\n\n**No marketing or promotional text messages are sent.**\n\n## **Message Frequency**\n\nMessage frequency varies depending on operational needs, delivery volume, weather, and driver schedule.\n\n## **Cost**\n\nStandard message and data rates may apply depending on your mobile carrier plan.\n\n## **Opt-Out Instructions**\n\nYou may opt out of AAA Delivery Service SMS communications at any time by replying:\n\n**STOP** or **UNSUBSCRIBE**\n\nYou will receive a final confirmation message acknowledging your opt-out request.\n\n## **Help Instructions**\n\nFor assistance, reply **HELP** to any AAA Delivery Service message, or contact us directly at:\n**✉️ [privacy@aaadeliveryservice.com](mailto:privacy@aaadeliveryservice.com)\n☎️[ (844) 222-0206](tel:+18442220206)**\n\n## **Privacy and Data Use**\n\nAAA Delivery Service is committed to protecting your privacy.\n\n* Your personal data and mobile information are **collected and used only for operational and service-related purposes**, such as registration, dispatch communication, and delivery coordination.\n* Your information is **not sold** and **not shared with third parties for marketing purposes**.\n* Your information is **not transferred to external organizations**, except as required by law.\n* We maintain **strict safeguards and security measures** to prevent unauthorized access, use, or sharing of your information.\n\nFor full details, please review our Privacy Policy at:\\\n<https://aaadeliveryservice.com/privacy>\n\n## **Carriers Disclaimer**\n\nWireless carriers are not liable for delayed or undelivered messages.\n\n## **Eligibility**\n\nThis SMS program is intended exclusively for AAA Delivery Service employees and independent contractor drivers age 18 or older.\n\n## **Contact Information**\n\nAAA Delivery Service, LLC\n[8813 N Tarrant Pkwy, Suite 236\nNorth Richland Hills, TX 76182](https://www.google.com/maps/place/8813+N+Tarrant+Pkwy+%23236,+North+Richland+Hills,+TX+76182,+USA/@32.9053543,-97.1989105,771m/data=!3m2!1e3!4b1!4m5!3m4!1s0x864dd668a143021b:0xa6419ffe14be8c58!8m2!3d32.9053543!4d-97.1963356?entry=ttu&g_ep=EgoyMDI1MTEwOS4wIKXMDSoASAFQAw%3D%3D)\n\n✉️ [privacy@aaadeliveryservice.com](mailto:privacy@aaadeliveryservice.com)📞 **(844) 222-0206**"
}