{
  "title": "Privacy policy",
  "subtitle": "",
  "p1": "",
  "p2": "# Privacy Policy\n\nAAA Delivery Service, LLC. (\"AAA Delivery Service,\" \"we,\" or \"us\") respects the privacy rights of our online visitors and mobile application users. This Privacy Policy explains how AAA Delivery Service collects, uses, shares and protects information about you. This Privacy Policy also describes how you can access/change your information and make choices about how your information is used.\n\nThis Privacy Policy covers both our online, including websites and mobile sites and applications, and offline activities (\"Services\") made available to you. This Privacy Policy also applies to your use of interactive features or downloads that: (i) we own or control; (ii) are available through the Services; or (iii) interact with the Services and post or incorporate this Privacy Policy.\n\nBY USING OUR SERVICES OR BY OTHERWISE GIVING US YOUR INFORMATION, YOU AGREE TO THE TERMS OF THIS PRIVACY POLICY. Please review this Privacy Policy carefully. If you do not agree to this Privacy Policy, do not use our Services. You should also review our Terms of Service, which may apply to your use of our websites and mobile applications. This Privacy Policy is incorporated by reference into the Terms of Service. We may update this Privacy Policy to reflect changes to our information practices. Any changes will be effective immediately upon the posting of the revised Privacy Policy. We will provide notice of changes by email (sent to the e-mail address specified in your account) or by means of a notice on the Services prior to the change becoming effective. We encourage you to periodically review this page for the latest information on our privacy practices.\n\nIf you have questions about this Privacy Policy, please contact us at privacy@aaadeliveryservice.com\n\n## 1. Information We Collect\n\n##### a. User Provided Information\n\nPersonal Information. We may ask you to provide us with certain categories of information such as personal information, which is information that could reasonably be used to identify you personally, such as your name, company, e-mail address, and mobile number (\"Personal Information\"). We may collect this information through forms in the Services, including account registration forms, contact us forms, or when you otherwise interact with us. When you sign up to use the Services, you will be required to create an account profile.\n\nIf you choose to upload a photo when registering for our Services, the photo may be viewable by us and by the couriers who are picking up or delivering packages so that they are able to verify your identity. You may remove or update the photo at any time by logging into your account.\n\n##### b. User Generated Content and Public Information\n\nThe Services may offer publicly accessible blogs or community forums or other ways to permit you to submit ideas, photographs, user profiles, writings, music, video, audio recordings, computer graphics, pictures, data, questions, comments, suggestions, or other content, including Personal Information (collectively, \"User Content\"). We or others may reproduce, publish, distribute, or otherwise use User Content online or offline in any media or format (currently existing or hereafter developed). Others may have access to this User Content and may have the ability to share it with third parties across the Internet. You should be aware that any User Content you provide in these areas may be read, collected, and use by others who access them. Thus, please think carefully before deciding what information you share, including Personal Information, in connection with your User Content. Please note that Company does not control who will have access to the information that you choose to make public and cannot ensure that parties who have access to such publicly available information will respect your privacy or keep it secure. This Privacy Policy does not apply to any information that you disclose publicly, share with others, or otherwise upload, whether through the Services or otherwise. We are not responsible for the accuracy, use or misuse of any content or information that you disclose or receive through the Services.\n\nWe may also publish your name, voice, likeness, and other Personal Information that is part of your User Content, and we may use the content, or any portion of the content, for advertising, marketing, publicity, and promotional activities.\n\nTo request removal of your User Content from our blog or community forum or similar features, contact us through customer support. In some cases, we may not be able to remove your user content, in which case we will let you know if we are unable to do so and why.\n\n##### c. Information Collected Through Your Access and Use of the Services\n\n## Information Collection and Use\n\nFor a better experience while using our Service, we may require you to provide us with certain personally identifiable information, including but not limited to your name, phone number, and postal address. The information that we collect will be used to contact or identify you.\n\n## Log Data\n\nWe want to inform you that whenever you visit our Service, we collect information that your browser sends to us that is called Log Data. This Log Data may include information such as your computer's Internet Protocol (\"IP\") address, browser version, pages of our Service that you visit, the time and date of your visit, the time spent on those pages, and other statistics.\n\n## Cookies\n\nCookies are files with small amount of data that is commonly used an anonymous unique identifier. These are sent to your browser from the website that you visit and are stored on your computer's hard drive.\n\nOur website uses these \"cookies\" to collection information and to improve our Service. You have the option to either accept or refuse these cookies, and know when a cookie is being sent to your computer. If you choose to refuse our cookies, you may not be able to use some portions of our Service.\n\n## Service Providers\n\nWe may employ third-party companies and individuals due to the following reasons:\n\n* To facilitate our Service;\n* To provide the Service on our behalf;\n* To perform Service-related services; or\n* To assist us in analyzing how our Service is used.\n\nWe want to inform our Service users that these third parties have access to your Personal Information. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose.\n\n## Security\n\nWe value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, and we cannot guarantee its absolute security.\n\n## Links to Other Sites\n\nOur Service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are not operated by us. Therefore, we strongly advise you to review the Privacy Policy of these websites. We have no control over, and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services.\n\nChildren's Privacy\n\nOur Services do not address anyone under the age of 13. We do not knowingly collect personal identifiable information from children under 13. In the case we discover that a child under 13 has provided us with personal information, we immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact us so that we will be able to do necessary actions.\n\n## Changes to This Privacy Policy\n\nWe may update our Privacy Policy from time to time. Thus, we advise you to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately, after they are posted on this page.\n\nOur Privacy Policy was created with the help of the [Privacy Policy Template](https://www.privacypolicytemplate.net).\n\n## Contact Us\n\nIf you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us."
}