{
  "title": "Privacy",
  "subtitle": "",
  "p1": "",
  "p2": "# Privacy Policy\n\nAAA Delivery Service, LLC. (\"AAA Delivery Service,\" \"we,\" or \"us\") respects the privacy rights of our online visitors and mobile application users. This Privacy Policy explains how AAA Delivery Service collects, uses, shares and protects information about you. This Privacy Policy also describes how you can access/change your information and make choices about how your information is used.\n\nThis Privacy Policy covers both our online, including websites and mobile sites and applications, and offline activities (\"Services\") made available to you. This Privacy Policy also applies to your use of interactive features or downloads that: (i) we own or control; (ii) are available through the Services; or (iii) interact with the Services and post or incorporate this Privacy Policy.\n\nBY USING OUR SERVICES OR BY OTHERWISE GIVING US YOUR INFORMATION, YOU AGREE TO THE TERMS OF THIS PRIVACY POLICY. Please review this Privacy Policy carefully. If you do not agree to this Privacy Policy, do not use our Services. You should also review our Terms of Service, which may apply to your use of our websites and mobile applications. This Privacy Policy is incorporated by reference into the Terms of Service. We may update this Privacy Policy to reflect changes to our information practices. Any changes will be effective immediately upon the posting of the revised Privacy Policy. We will provide notice of changes by email (sent to the e-mail address specified in your account) or by means of a notice on the Services prior to the change becoming effective. We encourage you to periodically review this page for the latest information on our privacy practices.\n\nIf you have questions about this Privacy Policy, please contact us at [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com)\n\n## 1. Information We Collect\n\n### a. User Provided Information\n\nPersonal Information. We may ask you to provide us with certain categories of information such as personal information, which is information that could reasonably be used to identify you personally, such as your name, company, e-mail address, and mobile number (\"Personal Information\"). We may collect this information through forms in the Services, including account registration forms, contact us forms, or when you otherwise interact with us. When you sign up to use the Services, you will be required to create an account profile.\n\nIf you choose to upload a photo when registering for our Services, the photo may be viewable by us and by the couriers who are picking up or delivering packages so that they are able to verify your identity. You may remove or update the photo at any time by logging into your account.\n\n### b. User Generated Content and Public Information\n\nThe Services may offer publicly accessible blogs or community forums or other ways to permit you to submit ideas, photographs, user profiles, writings, music, video, audio recordings, computer graphics, pictures, data, questions, comments, suggestions, or other content, including Personal Information (collectively, \"User Content\"). We or others may reproduce, publish, distribute, or otherwise use User Content online or offline in any media or format (currently existing or hereafter developed). Others may have access to this User Content and may have the ability to share it with third parties across the Internet. You should be aware that any User Content you provide in these areas may be read, collected, and use by others who access them. Thus, please think carefully before deciding what information you share, including Personal Information, in connection with your User Content. Please note that Company does not control who will have access to the information that you choose to make public and cannot ensure that parties who have access to such publicly available information will respect your privacy or keep it secure. This Privacy Policy does not apply to any information that you disclose publicly, share with others, or otherwise upload, whether through the Services or otherwise. We are not responsible for the accuracy, use or misuse of any content or information that you disclose or receive through the Services.\n\nWe may also publish your name, voice, likeness, and other Personal Information that is part of your User Content, and we may use the content, or any portion of the content, for advertising, marketing, publicity, and promotional activities.\n\nTo request removal of your User Content from our blog or community forum or similar features, contact us through customer support. In some cases, we may not be able to remove your user content, in which case we will let you know if we are unable to do so and why.\n\n### c. Information Collected Through Your Access and Use of the Services\n\nIn addition to the information that you directly submit to us, we and our third-party service providers may use a variety of technologies that automatically collect information whenever you visit or interact with the Services (\"Usage Information\"). This Usage Information may include the browser that you are using, the URL that referred you to our Services, all the areas within our Services that you visit, and the time of day, among other information. We may use Usage Information for a variety of purposes, including to enhance or otherwise improve the Services. In addition, we collect your IP address or other unique identifier (\"Device Identifier\") for your computer, mobile or other device used to access the Services (\"Device\"). Usage Information may be non-identifying or may be associated with you. Whenever we associate Usage Information or a Device Identifier with your Personal Information, we will treat it as Personal Information.\n\nIn addition, tracking information is collected as you use our Services, including, but not limited to geolocation. If you are sending a package requested via our Services, the courier's mobile device will send your GPS coordinates, during the delivery process, to our servers. Most GPS enabled mobile devices can define one's location to within 50 feet. We collect this information for various purposes, including to determine the charge for your delivery, to provide customer support, to send promotions and offers, to enhance our Services, and for our internal business purposes.\n\nWe may also collect Usage Information using the following methods or technologies to name a few:\n\nCookies. A cookie is a data file placed on a Device when it is used to access the Services. A Flash cookie is a data file placed on a Device via the Adobe Flash plug-in that may be built-in to or downloaded by you to your Device. Cookies and Flash Cookies may be used for many purposes, including, without limitation, remembering you and your preferences and tracking your visits to our web pages. Cookies work by assigning a number to the user that has no meaning outside of the assigning website.\n\nYour browser allows you to deny or accept the use of cookies. Cookies can be disabled or controlled by setting a preference within your web browser or on your Device. However, if you disable cookies or Flash cookies on your Device, some features of the Services may not function properly or may not be able to customize the delivery of information. The Company cannot control the use of cookies (or the resulting information) by third parties, and use of third-party cookies is not covered by this Privacy Policy.\n\nWeb Beacons. Small graphic images or computer code called web beacons may be included in our web and mobile pages and messages. The web beacons are tiny graphics with a unique identifier, similar in function to cookies, and are used to track the online movements of Web users. In contrast to cookies, which are stored in a user's computer hard drive, web beacons are embedded invisibly on Web pages. Web beacons or similar technologies help us better manage content on our Services by informing us what content is effective, count users of the Services, monitor how users navigate the Services, count how many e-mails that we send were opened or to count how many particular articles or links were actually viewed. We do not tie the information gathered by web beacons to our customers' personal information.\n\nEmbedded Scripts. An embedded script is computer code that is designed to collect information about your interactions with the Services, such as the links you click on. The code is temporarily downloaded onto your Device from our web server or a third-party service provider, is active only while you are connected to the Services and is deactivated or deleted thereafter.\n\n### d. Information Third Parties Provide About You\n\nWe may, from time to time, supplement the information we collect about you through our website or Mobile Application with outside records from third parties in order to enhance our ability to serve you, to tailor our content to you and to offer you opportunities to purchase products or services that we believe may be of interest to you. We may combine the information we receive from those sources with information we collect through the Services. In those cases, we will apply this Privacy Policy to any Personal Information received, unless we have disclosed otherwise.\n\n### e. Information You Provide About a Third Party\n\nIf you choose to use our Services we will ask you for the recipient's name, phone number, delivery address and email address. We will provide this information to our courier for the purpose of providing the Services. We may also send the recipient a one-time email inviting them to visit aaadeliveryservice.com and provide promotions or an invitation to use the Services. We may store this information for the purpose of sending this one-time email, tracking the deliveries, maintaining a \"quick contact list\" for frequently used delivery recipients (this will only be accessible from your user account), and we do not use this information for any other marketing purpose unless we obtain consent from that person, or we explicitly say otherwise. Please be aware that when you enter the recipient's email address through our Services, your name, e-mail address and physical address may be included in the communication sent to the recipient.\n\n### f. Geolocation Data\n\nWith respect to geolocation data we track through Mobile Devices, we use that geolocation information for various purposes including for you to be able to set the location from which you wish your package to be picked up and delivered, to track courier progress and provide that information to you and your recipient, to send you promotions and offers, and to allow you (if you choose through any features we may provide) to share this information with other people. Except as otherwise permitted in this Privacy Policy, we will not share this information with third parties for any purpose and will only use this information for the sole purpose of providing you with the Services. You may at any time no longer allow our Services to use your location by turning this feature off at the Mobile Device level.\n\nWe also provide some of your Personal Information (such as your first name, email address, phone number and physical address) to the courier so that the courier may contact and find you. We may associate your unique Mobile Device identifier or Service usage information with any Personal Information you provide, but we will treat the combined information as Personal Information.\n\n### g. Information Collected from Couriers and Other Applicants\n\nIf you wish to apply for a job on our website, we will collect Personal Information such as your name, email address, phone number, insurance information, driver's license, social security number and may collect additional information such as resume, gender, and your ethnicity. We use the information collected within this area of the website to determine your qualifications for the position in which you have applied and to contact you to set up an interview.\n\n## 2. Use of the Collected Information\n\nWhen you register for an account with us, we will send you welcome email and promotional emails inviting you to use the Services. We will also communicate with you in response to your inquiries, to provide the Services you request, and to manage your account. We will communicate with you by email, telephone, push notification, and SMS or text message.\n\nWe use your information to understand which features of the Services are used most, to allow you to view your pickup and delivery history, store your credit card information on a secure page, view any promotions we may currently be running, rate the Services, and to otherwise improve the Services. The credit card information you provide in your personal profile at sign-up is not stored by us but is stored and used by our third-party credit card processors in order for them to process payment that you owe third parties for transportation services received by you.\n\nWe use your IP address to help diagnose problems with our computer server, and to administer our website(s). Your IP address is used to help identify you but contains no personal information about you.\n\nWe will send you transactional-related communications in connection with the Services. These communications may include but are not limited to notification that a package has been picked up or delivered, transactional summaries, maintenance notifications or other Services disruption notifications. Generally, you may not opt-out of these communications, which are not promotional in nature.\n\nIn addition, we may use your Personal Information or Usage Information that we collect about you: (1) to provide you with information or services or process transactions that you have requested or agreed to receive including to send you electronic newsletters, or to provide you with special offers or promotional materials on behalf of us or third parties; (2) to process your registration with the Services, including verifying your information is active and valid; (3) to improve the Services or our services, to customize your experience with the Services, or to serve you specific content that is most relevant to you; (4) to enable you to participate in a variety of the Services' features such as online or mobile entry sweepstakes, contests or other promotions; (5) to contact you with regard to your use of the Services and, in our discretion, changes to the Services and/or the Services' policies; (6) for internal business purposes; (7) for inclusion in our data analytics; and (8) for purposes disclosed at the time you provide your information or as otherwise set forth in this Privacy Policy.\n\n### SMS Privacy Disclosure\n\nAAA Delivery Service uses SMS messaging strictly for operational purposes with employees and independent contractor drivers. Personal information collected for SMS communications is **not sold or shared with third parties**. **Text message opt-ins are excluded from any information sharing.** You may opt out of SMS communications at any time by replying **STOP**, or request assistance by contacting us at [privacy@aaadeliveryservice.com](<>) or **(844) 222-0206**.\n\n**Additional SMS Privacy Notice (Required for SMS Compliance)**\\\nWe are committed to protecting your privacy. We collect consumer data, including phone numbers, solely for business operations such as SMS registration. Your data and mobile information are not shared with third parties for marketing purposes. Data sharing is strictly limited to what is necessary for our business operations or as required by law.\n\nYour data will not be transferred to external organizations. We implement measures to prevent unauthorized data sharing and safeguard your information.\n\nYou have the right to opt out of communications at any time. To opt out, simply text **STOP** or **UNSUBSCRIBE**.\n\nFor any questions or concerns regarding your data or this privacy policy, please contact us at [privacy@aaadeliveryservice.com](<>) or **(844) 222-0206**.\n\n\n\nYour data will not be transferred to external organizations. We implement measures to prevent unauthorized data sharing and safeguard your information.\n\nYou have the right to opt out of communications at any time. To opt out, simply text **STOP** or **UNSUBSCRIBE**.\n\nFor any questions or concerns regarding your data or this privacy policy, please contact us at **[privacy@aaadeliveryservice.com](<>)** or **(844) 222-0206**.\n\n\n\n## 3.Disclosure of Information to Third Parties\n\nWe may share non-personally identifiable information, such as aggregated user statistics and log data, with third parties for industry analysis, demographic profiling, to deliver targeted advertising about other products or services, or for other business purposes. We do not sell, share, rent or trade the information we have collected about you, including Personal Information, other than as disclosed within this Privacy Policy or at the time you provide your information. We do not share your Personal Information with third parties for those third parties' direct marketing purposes unless you consent to such sharing at the time you provide your Personal Information.\n\n### a. When You Agree to Receive Information from Third Parties\n\nYou may be presented with an opportunity to receive information and marketing offers directly from third parties. If you do agree to have your Personal Information shared, your Personal Information will be disclosed to such third parties and all information you disclose will be subject to the privacy policy and practices of such third parties. We are not responsible for the privacy policies and practices of such third parties and, therefore, you should review the privacy policies and practices of such third parties prior to agreeing to receive such information from them. If you later decide that you no longer want to receive communication from a third party, you will need to contact that third party directly.\n\n### b. Third Parties Providing Services on Our Behalf.\n\nWe use third party companies and individuals to facilitate our Services, provide or perform certain aspects of the Services on our behalf. We may provide vendors with access to user information, including Personal Information, this information sharing is limited to only the information needed by the vendor to carry out the services they are performing for you or for us. Each of these vendors are obligated not to disclose or use Personal Information for any other purpose.\n\nWhile we may use third party analytics service providers to evaluate and provide us with information about the use of the Services and viewing of our content, we do not share Personal Information with these analytics service providers, but they may set and access their own cookies, web beacons and embedded scripts on your Device and they may otherwise collect or have access to information about you, including non-personally identifiable information.\n\nWe use a third-party hosting provider who hosts our support section of our website. Information collected within this section of our website is governed by our Privacy Policy.\n\n### c. Contests and Promotions\n\nWe may offer sweepstakes, contests, and other promotions (any, a \"Promotion\") through the Services that may require registration. By participating in a Promotion, you are agreeing to official rules that govern that Promotion, which may contain specific requirements of you, including, allowing the sponsor of the Promotion to use your name, voice and/or likeness in advertising or marketing associated with the Promotion. If you choose to enter a Promotion, Personal Information may be disclosed to third parties or the public in connection with the administration of such Promotion, including, in connection with winner selection, prize fulfillment, and as required by law or permitted by the Promotion's official rules, such as on a winners list.\n\n### d. Legal Reasons\n\nWe cooperate with government and law enforcement officials and private parties to enforce and comply with the law. Thus, we may access, use, preserve, transfer and disclose your information (including Personal Information), including disclosure to third parties such as government or law enforcement officials or private parties as we reasonably determine is necessary and appropriate: (i) to satisfy any applicable law, regulation, subpoenas, governmental requests or legal process; (ii) to protect and/or defend the Terms of Service for online and mobile Services or other policies applicable to any online and mobile Services, including investigation of potential violations thereof; (iii) to protect the safety, rights, property or security of AAA Delivery Service, our Services or any third party; (iv) to protect the safety of the public for any reason; (v) to detect, prevent or otherwise address fraud, security or technical issues; or (vi) to prevent or stop activity we may consider to be, or to pose a risk of being, an illegal, unethical, or legally actionable activity. Further, we may use IP address or other Device Identifiers, to identify users, and may do so in cooperation with third parties such as copyright owners, internet service providers, wireless service providers or law enforcement agencies, including disclosing such information to third parties, all in our discretion. Such disclosures may be carried out without notice to you.\n\n### e. Business Transfer\n\nWe may share your information, including your Personal Information and Usage Information with our parent, subsidiaries, and affiliates for internal reasons. We also reserve the right to disclose and transfer all such information: (i) to a subsequent owner, co-owner or operator of the Services or applicable database; or (ii) in connection with a corporate merger, consolidation, restructuring, the sale of substantially all of our membership interests and/or assets or other corporate change, including, during the course of any due diligence process.\n\n## 4. Behavioral Advertising and Opt-Out\n\nTargeted advertising (also known as Behavioral Advertising) uses information collected on an individual's web or mobile browsing behavior such as the pages they have visited or the searches they have made. This information is then used to select which advertisements should be displayed to a particular individual on websites other than our website. For example, if you have shown a preference for football while visiting our website, you may be served an advertisement for football-related equipment when you visit a site other than our website. The information collected is only linked to an anonymous cookie identifier; it does not include any information that could be linked back to a particular person, such as their name, address, or credit card number. The information used for targeted advertising either comes from us or through third party website publishers.\n\nIf you would like to opt out of targeted advertising from us that occurs when visiting our third-party advertising publishers, please click here to access the NAI Opt-Out Page. Please note that this will opt you out of targeted ads from us and any other participating advertisers. If you opt out, you may continue to receive online advertising from us; however, these ads may not be as relevant to you.\n\nIn order for behavioral advertising opt-outs to work on your Device, your browser must be set to accept cookies. If you delete cookies, buy a new Device, access our Services from a different device, login under a different screen name, or change web browsers, you will need to opt-out again. If your browser has scripting disabled, you do not need to opt out, as online behavioral advertising technology does not work when scripting is disabled. Please check your browser's security settings to validate whether scripting is active or disabled.\n\nAdditionally, many network advertising programs allow you to view and manage the interest categories they have compiled from your online browsing activities. These interest categories help determine the types of targeted advertisements you may receive. The NAI Opt-Out Page provides a tool that identifies its member companies that have cookies on your browser and provides links to those companies.\n\n## 5. Third Party Content and Links to Third Party Services\n\nThe Services may contain content that is supplied by a third party, and those third parties may collect website usage information and your Device Identifier when web pages from any online or mobile Services are served to your browser. In addition, when you are using the Services, you may be directed to other sites or applications that are operated and controlled by third parties that we do not control. We are not responsible for the privacy practices employed by any of these third parties. For example, if you click on a banner advertisement, the click may take you away from one of our websites onto a different website. These other websites may send their own cookies to you, independently collect data or solicit Personal Information and may or may not have their own published privacy policies. When you leave our website or Services, please be sure to read the privacy statements of all third-party websites or applications before submitting any Personal Information to third parties.\n\n## 6. Social Media Features\n\nOur Services may include social media features, such as the Facebook Like button, and widgets such as a \"Share This\" button, or interactive mini programs that run on our online and mobile Services. These features may collect your IP address, which page you are visiting on our online or mobile Services and may set a cookie to enable the feature to function properly. Social media features and widgets are either hosted by a third party or hosted directly on our online Services. Your interactions with these features and widgets are governed by the privacy policy of the company providing them.\n\n## 7. Changing Your Information\n\nYou are responsible for maintaining the accuracy of the information you submit to us, such as your contact information provided as part of account registration. If your Personal Information changes, or if you no longer desire our Services, you may correct, delete inaccuracies, or amend information by making the change on our member information page or by contacting us through customer support. We will make good faith efforts to make requested changes in our then active databases as soon as reasonably practicable.\n\nYou may modify your account or the communications that you have elected to receive from the Services by following the instructions contained within an e-mail or by logging into your user account and changing your communication preferences.\n\nWe will retain your Personal Information and Usage Information (including geolocation) for as long as your account with the Services is active and as needed to provide you services. We will retain your Personal Information and Usage Information (including geolocation, delivery history, credit card information and transaction history) as needed to comply with our legal and regulatory obligations, resolve disputes, conclude any activities related to cancellation of an account (such as addressing chargebacks from your credit card companies), investigate or prevent fraud and other inappropriate activity, to enforce our agreements, and for other business reason. After a period of time, your data may be anonymized and aggregated, and then may be held by us as long as necessary for us to provide our Services effectively, but our use of the anonymized data will be solely for analytic purposes.\n\n## 8. No Children\n\nOur Services are not directed toward minors, no one under 18 (and certainly no children under 13) are allowed to register with or use the Services. We do not knowingly collect Personal Information from anyone under the age of 18. If we discover that we have collected Personal Information from a person under 18, we will delete as soon as reasonably possible. If you are a parent or guardian of a minor under the age of eighteen (18) and believe he or she has disclosed Personal Information to us, please contact us at [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com)\n\n## 9. Security\n\nThe Personal Information and Usage Information we collect is securely stored within our databases, and we use standard, industry-wide, commercially reasonable security practices such as encryption, firewalls, and SSL (Secure Socket Layers) for protecting your information - such as any portions of your credit card number which we retain (we do not ourselves retain your entire credit card information) and geolocation information. However, as effective as encryption technology is, no security system is impenetrable. We cannot guarantee the security of our databases, nor can we guarantee that information you supply won't be intercepted while being transmitted to us over the Internet or wireless communication, and any information you transmit to AAA Delivery Service you do at your own risk. We recommend that you not disclose your password to anyone.\n\n## 10. Your California Privacy Rights\n\nAAA Delivery Service collects various types of personal information about you both online and offline, as described in this privacy policy. Under California law, AAA Delivery Service customers who are residents of California may request certain information about our disclosure of personal information during the prior calendar year to third parties for their direct marketing purposes. To make such a request, please write to us at the following address:\n\n8813 N Tarrant Pkwy\nSuite 236\nNorth Richland Hills, TX 76182\n\nAlternatively, you may send us an email at [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com) with the words \"California Privacy Rights\" in the subject line.\n\nAAA Delivery Service does not track its customers over time and across third party websites to provide targeted advertising and therefore does not respond to Do Not Track (DNT) signals. However, some third-party sites do keep track of your browsing activities when they serve you content, which enables them to tailor what they present to you. If you are visiting such sites, your browser may allow you to set the DNT signal on your browser so that third parties (particularly advertisers) know you do not want to be tracked.\n\nAAA Delivery Service offers interactive services which allow you to post content to share publicly. At any time, you can delete or remove content you have posted using the deletion or removal options within our services. If you have questions about how to remove content in a specific service or if you would like additional assistance with deletion, you can contact support. Although we offer deletion capability for our services, you should be aware that the removal of content may not ensure complete or comprehensive removal of that content or information posted through the services.\n\n## 11. Information Processed And Stored In The United States\n\nInformation we collect, including, Personal Information, will be processed and stored in the United States. Your Personal Information may be subject to access requests from governments, courts, or law enforcement in the United States according to laws of the United States. By using the Services or providing us with any information, you consent to the processing and storage of your information in the United States.\n\n## 12. Contact Us\n\nAAA Delivery Service, LLC.\nAttn: Privacy\n8813 N Tarrant Pkwy\nSuite 236\nNorth Richland Hills, TX 76182\\n\n\nEmail: [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com)"
}