{
  "l2title2": "Customer Focus",
  "l2content3": "Our dedicated team of couriers and staff are vetted professionals, ensuring a high standard of service and care for your deliveries.",
  "l2title3": "Professionalism",
  "r2img": "/images/twitter-post-photo-collage-1-1-.png",
  "bottomContent1": "At AAA, we're not just delivering packages; we're delivering peace of mind. Partner with us and let your logistics worries become our responsibility. Whether you need secure medical deliveries, tailored solutions, or streamlined operations, we've got you covered.",
  "paragraphImage1": "/images/industries9.png",
  "bottomContent2": "[Request a Quote:](/speak-to-a-specialist) Curious about how much you can save on courier costs? Reach out for a personalized quote and discover the unmatched value AAA Delivery Service can offer your business.",
  "founders": [
    {
      "pgimg": {
        "name": "Roger Sepulveda",
        "job": "Founder & Chief Executive Officer",
        "image": "/images/1.roger.png"
      }
    },
    {
      "pgimg": {
        "name": "Melody Reyna",
        "job": "Chief Financial Officer",
        "image": "/images/2.melody.png"
      }
    },
    {
      "pgimg": {
        "name": "Bill Jones",
        "job": "Chief Technology Officer",
        "image": "/images/guy.png"
      }
    },
    {
      "pgimg": {
        "name": "Jordan Kingcaid",
        "job": "Chief Marketing Officer",
        "image": "/images/4.jordan.png"
      }
    },
    {
      "pgimg": {
        "name": "Jordan Kingcaid",
        "job": "Director Of Marketing",
        "image": "/images/guy.png"
      }
    },
    {
      "pgimg": {
        "name": "Leticia Gonzalez",
        "job": "Director Of People Operations",
        "image": "/images/6.lety.png"
      }
    },
    {
      "pgimg": {
        "name": "Ponciano Gonzalez",
        "job": "Director Of Supply Chain Operations",
        "image": "/images/guy.png"
      }
    },
    {
      "pgimg": {
        "name": "Joshua Sepulveda",
        "job": "Director Of Logistics",
        "image": "/images/guy.png"
      }
    }
  ],
  "bottomTitle1": "Ready to Experience Exceptional Delivery Services?",
  "paragraphImage2": "/images/industries9.png",
  "bottomTitle2": "Get Started Today:",
  "paragraphContent1": "Founded in 1995 as AC Express, we embarked on a journey fueled by a vision for unparalleled delivery service. Over the years, our dedication to fast, efficient, and reliable deliveries earned us a reputation as a reputable service provider in the Dallas-Fort Worth metroplex, Austin, San Antonio, and Houston.",
  "paragraphContent2": "In the pursuit of excellence, we rebranded ourselves as AAA Delivery Service, embodying three core principles: Customer Obsession, People-Led, and Innovation-Driven.",
  "paragraphTitle1": "Our History \\n \\n From AC Express to AAA Delivery Service",
  "c2content2": "We embrace cutting-edge technology and innovative solutions to provide you with the best delivery experience possible.",
  "paragraphContent3": "Driven by our core values of Integrity, Leadership, Commitment, Excellence, Safety, and Professionalism, our mission is to deliver exceptional logistics solutions that drive competitive advantages and sustained value for our customers.\n\nWe aim to be indispensable to our customers by providing unparalleled peace of mind and freeing them to focus on their core businesses. Through our unwavering commitment to these values, we continually strive to exceed expectations, ensuring reliability, adaptability, and customized solutions tailored to our customers' unique needs.",
  "blueTopText": "Partnering with AAA Delivery Service means partnering with a reliable, customer-focused, and technologically advanced logistics provider. Your deliveries are in good hands with us, allowing you to focus on what matters most - your core business.",
  "paragraphTitle2": "Transformation and Commitment",
  "topsmtitle": "Our Executive Team",
  "c2title2": "Innovation",
  "c2title": "Efficiency",
  "paragraphTitle3": "Our Mission, Vision, and Values",
  "c2content": "With our advanced logistics solutions, we streamline the delivery process, making it quick, easy, and hassle-free.",
  "middleContent2": "At AAA, our advanced same-day transportation integrates seamlessly with your logistics network. From secure medical deliveries to tailored solutions, providing unwavering reliability, flexibility, and robust support. Our services are designed to empower your lab's productivity, ensuring streamlined operations and efficient healthcare logistics management.",
  "middleTitle2": "Advantages Of Partnering With AAA \\n Delivery Service",
  "topStep1": "Customer Obsession!| Cultivating Creativity!",
  "paragraphContent1hidden": "At AAA, our customers are at the heart of everything we do. We obsess over understanding their needs, and providing reliable, adaptable, and customized delivery solutions. Through our relentless commitment to customer satisfaction, we measure our success by the improvements in our net promoter score.",
  "paragraphTitle1hidden": "Customer Obsession",
  "topStep2": "People-Led,| Nurturing Talent!",
  "paragraphContent2hidden": "Our success is not just about deliveries; it’s about our people. We foster a culture where our employees, drivers, and sub-contractors bring their energy to work. This People-Led approach ensures our clients receive service that goes beyond their expectations.",
  "bottomsmtext": "",
  "paragraphContent3hidden": "At AAA Delivery Service, we believe that doing the right thing is not just a responsibility — it’s who we are. We hold ourselves to the highest standards of ethics, compliance, and professionalism in every delivery we make.\n\nIntegrity is at the heart of everything we do. It guides our decisions, builds trust with our clients and partners, and strengthens our mission to support the healthcare community.\n\nOur Code of Conduct empowers our team to act with transparency, respect, and accountability. We are committed to earning the trust of every customer and creating a workplace where excellence and ethical behavior are the foundation of success.\n\nAt AAA Delivery Service, integrity isn’t just a value — it’s the way we deliver every day.\n\n## Our Quality Policy\n\nWe are committed to excellence in everything we do. That means:\n\n* Delighting our customers\n* Maintaining the highest standards\n* Investing in continuous education and training for our team\n* Consistently delivering with accuracy, safety, and care",
  "topStep3": "Innovation-Driven,| Beyond Satisfaction!",
  "paragraphTitle2hidden": "People-Led: and Innovation-Driven",
  "paragraphContent4hidden": "Your satisfaction is our top priority. We focus on:\n\n* Reliability\n* On-time deliveries\n* Tailored transportation solutions\n* Cost savings of 10–30% within our coverage area\n\n**Join us on this journey. Experience delivery services redefined at AAA.**",
  "topStep4": "Quality Commitment,| Exceeding Standards!",
  "paragraphTitle3hidden": "Our Commitment to Integrity",
  "c2img": "/images/home10.png",
  "paragraphTitle4hidden": "Our Objective",
  "r2content1": "Our services are tailored to meet your specific requirements, offering a range of delivery options to suit your business needs.",
  "title": "Exceptional Logistics, Lasting Value!  AAA's Commitment to Communities and Customers",
  "r2content2": "We help you save on courier costs without compromising on service quality, allowing your business to thrive.",
  "r2title1": "Flexibility",
  "r2content3": "Our round-the-clock support ensures you have assistance whenever you need it, even on weekends and holidays.",
  "r2title2": "Cost-Effectiveness",
  "bottomStep1": "Save Money,| On Courier Costs!",
  "r2title3": "24/7 Availability",
  "bottomStep2": "Discover The| Unmatched Value!",
  "topsmtext": "Partnering with AAA Delivery Service means partnering with a reliable, customer-focused, and technologically advanced logistics provider. Your deliveries are in good hands with us, allowing you to focus on what matters most - your core business.",
  "bottomStep3": "Reach Out,| Speak To A Specialist!",
  "l2img": "/images/home7.png",
  "bottomStep4": "Contact Us Today,| Request A Quote!",
  "l2content1": "we are committed to on-time deliveries, ensuring your packages reach their destination safely and promptly.",
  "l2title1": "Reliability",
  "l2content2": "Our customer-centric approach means your needs are our top priority. We go the extra mile to ensure your satisfaction."
}