{
  "t4": "OUR OBJECTIVE",
  "p1": "***AAA Delivery Service specializes in customer satisfaction, reliability, and professionalism on every delivery. We consistently inspire our team members to stay focused on safety, the highest ethical and professional standards, and the needs of our customers and communities. Providing customers with on-demand, express, reliable same-day delivery & courier service, on-time critical transportation to all 48 states nationwide. Expediting packages, any size shipments delivered within your city or across the country, including same-day door-to-door delivery.***",
  "p2": "Customer obsession is the main focus of our organization because we believe that our future lies in the hands of our valued customers. Our leaders start with the customer and work backwards. We work vigorously to earn and keep customer trust. Although our leaders pay attention to our competitors, they obsess over customers. We are all about the long term, delivering value through customer focus leadership. We measure our success in this area through improvements in our net promoter score.",
  "p3": "As a people led organization, we are guided by the purpose of moving our communities forward by delivering what matters. We are modernizing our strong values-based culture and encouraging our employees, drivers and sub-contractors to bring their energetic selves to work – making AAA a place they enthusiastically recommend to friends and family. We measure our success on this strategic initiative through improvements in likelihood to recommend.",
  "p4": "Our dedicated innovation team help support and encourage idea sharing throughout our organization. Our Introduction idea sharing platform brings our employees, drivers, and sub-contractors together to share, collaborate and generate ideas, whether in-person or virtually, as well to submit their ideas, to comment and vote on ideas from other people. Our idea screening processes is in place, so our employees, drivers and sub-contractors know that their ideas are being considered. Our team of advocates inspires change throughout our organization, asking questions, supporting ideas, and demanding radical changes.",
  "founders": [
    {
      "pgimg": {
        "name": "Roger Sepulveda ",
        "job": "Founder & Chief Executive Officer"
      }
    },
    {
      "pgimg": {
        "job": "Chief Financial Officer ",
        "name": "Melody Reyna"
      }
    },
    {
      "pgimg": {
        "job": "Chief Technology Officer",
        "name": "Ben Martinez"
      }
    },
    {
      "pgimg": {
        "job": "Ashley Lary",
        "name": "Chief Marketing Officer"
      }
    },
    {
      "pgimg": {
        "job": "Director Of Marketing",
        "name": "Jordan Kingcaid "
      }
    },
    {
      "pgimg": {
        "name": "Leticia Gonzalez",
        "job": "Director Of People Operations"
      }
    },
    {
      "pgimg": {
        "name": "Jerry Jones",
        "job": "Director Of Logistics "
      }
    },
    {
      "pgimg": {
        "name": "Joshua Sepulveda",
        "job": "General Manager"
      }
    }
  ],
  "timage": "/images/image3.png",
  "pt1": "*To deliver exceptional logistics solutions that drive competitive advantages and sustained value for our customers. We achieve this by leveraging superior management, processes, and technology, guided by our core values of Integrity, Leadership, Commitment, Excellence, Safety, and Professionalism. Our goal is to strengthen communities and enhance lives by delivering the things that matter.*",
  "pt2": "**“To Be Indispensable to Our Customers”**\n\nOur vision is to be the most reliable, dependable, and technologically advanced delivery service provider across the nation, delivering unparalleled peace of mind and freeing our customers to focus on their core business. At AAA, we strive to be indispensable to our customers, earning their trust through exceptional service and innovative solutions that continuously exceed their expectations.",
  "pt3": "*At AAA Delivery Service, quality is our commitment to you.*\n\nWe will continuously strive to delight our customers with the outstanding quality of our courier and delivery service. To achieve this, we are dedicated to:\n\n**1.Creating Excellence:** We invest in the continuous education and training of our team, nurturing individuals who embody the highest standards of quality.\n\n**2.Elevating Standards:** We maintain and improve the highest standards of logistics and delivery service, ensuring your parcels are handled with care and precision.\n\n**3.Continuous Improvement:** We establish a “AAA Delivery Service Quality” framework, continually enhancing our quality management system and setting challenging quality objectives.\n\n**4.Change Management:** We record and control change points at each stage, guaranteeing a seamless and reliable service experience.\n\n**5.Effective Traceability:** We strengthen our courier and delivery service through an effective traceability system, ensuring your packages are always accounted for.\n\nWe firmly believe that our future lies in the hands of our valued customers, and our unwavering commitment to quality reflects our dedication to your satisfaction.",
  "pt4": "*At AAA Delivery Service, we are dedicated to achieving excellence.*\n\nOur primary objectives include:\n\n**1.Customer Satisfaction:** Ensuring our customers' complete satisfaction by providing outstanding service tailored to their needs.\n\n**2.Reliability:** Delivering parcels with utmost reliability, guaranteeing the safety and timely arrival of every package.\n\n**3.On-Time Deliveries:** Committing to on-time deliveries, honoring deadlines to keep our customers' businesses running smoothly.\n\n**4.Cost Efficiency:** Saving our clients 10-30% in courier costs within our coverage area, providing cost-effective solutions without compromising quality.\n\n**5.Advanced Transportation Solutions:** Offering a broad range of advanced transportation solutions that adapt to changing needs, ensuring flexibility and efficiency.\n\n**6.Meeting Future Expectations:** Anticipating and meeting the evolving expectations of our customers, providing innovative solutions for both present and future requirements.\n\nAt AAA Delivery Service, we relentlessly pursue these objectives, striving for excellence in every delivery, every interaction, and every solution we provide.",
  "title": "Customer Obsession, \\n People Led, \\n Innovation Driven",
  "t1": "MISSION",
  "t2": "VISION",
  "t3": "OUR QUALITY POLICY",
  "ut": "MISSION & VISION"
}