{"about-us":{"customer-obsession-people-led-innovation-driven.json":{"t4":"OUR OBJECTIVE","p1":"***AAA Delivery Service specializes in customer satisfaction, reliability, and professionalism on every delivery. We consistently inspire our team members to stay focused on safety, the highest ethical and professional standards, and the needs of our customers and communities. Providing customers with on-demand, express, reliable same-day delivery & courier service, on-time critical transportation to all 48 states nationwide. Expediting packages, any size shipments delivered within your city or across the country, including same-day door-to-door delivery.***","p2":"Customer obsession is the main focus of our organization because we believe that our future lies in the hands of our valued customers. Our leaders start with the customer and work backwards. We work vigorously to earn and keep customer trust. Although our leaders pay attention to our competitors, they obsess over customers. We are all about the long term, delivering value through customer focus leadership. We measure our success in this area through improvements in our net promoter score.","p3":"As a people led organization, we are guided by the purpose of moving our communities forward by delivering what matters. We are modernizing our strong values-based culture and encouraging our employees, drivers and sub-contractors to bring their energetic selves to work – making AAA a place they enthusiastically recommend to friends and family. We measure our success on this strategic initiative through improvements in likelihood to recommend.","p4":"Our dedicated innovation team help support and encourage idea sharing throughout our organization. Our Introduction idea sharing platform brings our employees, drivers, and sub-contractors together to share, collaborate and generate ideas, whether in-person or virtually, as well to submit their ideas, to comment and vote on ideas from other people. Our idea screening processes is in place, so our employees, drivers and sub-contractors know that their ideas are being considered. Our team of advocates inspires change throughout our organization, asking questions, supporting ideas, and demanding radical changes.","founders":[{"pgimg":{"name":"Roger Sepulveda ","job":"Founder & Chief Executive Officer"}},{"pgimg":{"job":"Chief Financial Officer ","name":"Melody Reyna"}},{"pgimg":{"job":"Chief Technology Officer","name":"Ben Martinez"}},{"pgimg":{"job":"Chief Marketing Officer","name":"Ashley Leary"}},{"pgimg":{"job":"Director Of Marketing","name":"Jordan Kingcaid "}},{"pgimg":{"name":"Leticia Gonzalez","job":"Director Of People Operations"}},{"pgimg":{"name":"Ponciano Gonzalez","job":"Director Of Supply Chain Operations"}},{"pgimg":{"name":"Joshua Sepulveda","job":"Director Of Logistics "}}],"timage":"/images/image3.png","pt1":"*To deliver exceptional logistics solutions that drive competitive advantages and sustained value for our customers. We achieve this by leveraging superior management, processes, and technology, guided by our core values of Integrity, Leadership, Commitment, Excellence, Safety, and Professionalism. Our goal is to strengthen communities and enhance lives by delivering the things that matter.*","pt2":"**“To Be Indispensable to Our Customers”**\n\nOur vision is to be the most reliable, dependable, and technologically advanced delivery service provider across the nation, delivering unparalleled peace of mind and freeing our customers to focus on their core business. At AAA, we strive to be indispensable to our customers, earning their trust through exceptional service and innovative solutions that continuously exceed their expectations.","pt3":"We will continuously strive to delight our customers with the outstanding quality of our courier and delivery service.\n\nIn our endeavor to achieve this objective, we will;\n\n* Create and nurture people of quality by continuous education and training.\n* Maintain and improve the highest standards of logistics and delivery service.\n* Establish a “AAA Delivery Service Quality” framework to continually improve the quality management system and realize challenging quality objectives.\n* Record and control the change points at each stage.\n* Strengthen courier and delivery service by effective traceability system.\n\nWe believe that our future lies in the hands of our valued customers.","pt4":"Our primary objective is customer satisfaction, reliability, on time deliveries, and save our clients 10-30% in courier cost within our coverage area. Also, To Provide a broad range of advanced transportation solutions and the availability to make sure we meet the expectations of our customers, present and future. These solutions can be combined and configured to meet changing needs and requirements.","title":"Customer Obsession, \n People Led, \n Innovation Driven","t1":"MISSION","t2":"VISION","t3":"OUR QUALITY POLICY","ut":"MISSION & VISION"}},"carriers":{"become-a-carrier.json":{"title":"BECOME A CARRIER","subtitle":"Your Success Is Our Success.","p1":"It is our goal to offer exceptional service to our customers, and to achieve that, we believe in forming partnerships with top-notch carriers. Our primary focus is on building long-term relationships and delivering value through customer-centric leadership. If this resonates with you, we are eager to begin working together, addressing the challenges of today, navigating the future, and empowering your company to excel, thereby enhancing your delivery capabilities.","title2":"Welcome! Thank you for your interest in becoming an approved carrier for AAA. We look forward to working with you.","p2":"1. Provide your MC/MX# or DOT# to begin registration. Intrastate carriers without a DOT# may provide an applicable state registration number to begin registration.\n2. Supply your company contact information.\n3. Submit an electronic W9 (have your Tax-ID available).\n4. Complete the Carrier Profile.\n5. Read and ACCEPT the Agreement(s).\n6. Certificate of Insurance with AAA Delivery Service LLC as Certificate Holder:\n7. Provide a Certificate of Insurance that meets the insurance minimum requirements below. Certificates must be submitted from your insurance producer (agent)\n\n   * $100,000 Cargo Coverage\n   * $1,000,000 Auto Coverage\n8. If RMIS does not already have a copy of your certificate on file, we will request one for you from your insurance agent (producer).\n9. You will be required to meet the following requirements:\n10. Active Common or Contract Authority.\n\n    * Safety Rating must be Satisfactory, Conditional or None.\n    * Authority active for at least 90 days."},"privacy-policy.json":{"title":"Privacy Policy","subtitle":"","p1":"","p2":"# Privacy Policy\n\nAAA Delivery Service, LLC. (\"AAA Delivery Service,\" \"we,\" or \"us\") respects the privacy rights of our online visitors and mobile application users. This Privacy Policy explains how AAA Delivery Service collects, uses, shares and protects information about you. This Privacy Policy also describes how you can access/change your information and make choices about how your information is used.\n\nThis Privacy Policy covers both our online, including websites and mobile sites and applications, and offline activities (\"Services\") made available to you. This Privacy Policy also applies to your use of interactive features or downloads that: (i) we own or control; (ii) are available through the Services; or (iii) interact with the Services and post or incorporate this Privacy Policy.\n\nBY USING OUR SERVICES OR BY OTHERWISE GIVING US YOUR INFORMATION, YOU AGREE TO THE TERMS OF THIS PRIVACY POLICY. Please review this Privacy Policy carefully. If you do not agree to this Privacy Policy, do not use our Services. You should also review our Terms of Service, which may apply to your use of our websites and mobile applications. This Privacy Policy is incorporated by reference into the Terms of Service. We may update this Privacy Policy to reflect changes to our information practices. Any changes will be effective immediately upon the posting of the revised Privacy Policy. We will provide notice of changes by email (sent to the e-mail address specified in your account) or by means of a notice on the Services prior to the change becoming effective. We encourage you to periodically review this page for the latest information on our privacy practices.\n\nIf you have questions about this Privacy Policy, please contact us at [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com)\n\n## 1. Information We Collect\n\n### a. User Provided Information\n\nPersonal Information. We may ask you to provide us with certain categories of information such as personal information, which is information that could reasonably be used to identify you personally, such as your name, company, e-mail address, and mobile number (\"Personal Information\"). We may collect this information through forms in the Services, including account registration forms, contact us forms, or when you otherwise interact with us. When you sign up to use the Services, you will be required to create an account profile.\n\nIf you choose to upload a photo when registering for our Services, the photo may be viewable by us and by the couriers who are picking up or delivering packages so that they are able to verify your identity. You may remove or update the photo at any time by logging into your account.\n\n### b. User Generated Content and Public Information\n\nThe Services may offer publicly accessible blogs or community forums or other ways to permit you to submit ideas, photographs, user profiles, writings, music, video, audio recordings, computer graphics, pictures, data, questions, comments, suggestions, or other content, including Personal Information (collectively, \"User Content\"). We or others may reproduce, publish, distribute, or otherwise use User Content online or offline in any media or format (currently existing or hereafter developed). Others may have access to this User Content and may have the ability to share it with third parties across the Internet. You should be aware that any User Content you provide in these areas may be read, collected, and use by others who access them. Thus, please think carefully before deciding what information you share, including Personal Information, in connection with your User Content. Please note that Company does not control who will have access to the information that you choose to make public and cannot ensure that parties who have access to such publicly available information will respect your privacy or keep it secure. This Privacy Policy does not apply to any information that you disclose publicly, share with others, or otherwise upload, whether through the Services or otherwise. We are not responsible for the accuracy, use or misuse of any content or information that you disclose or receive through the Services.\n\nWe may also publish your name, voice, likeness, and other Personal Information that is part of your User Content, and we may use the content, or any portion of the content, for advertising, marketing, publicity, and promotional activities.\n\nTo request removal of your User Content from our blog or community forum or similar features, contact us through customer support. In some cases, we may not be able to remove your user content, in which case we will let you know if we are unable to do so and why.\n\n### c. Information Collected Through Your Access and Use of the Services\n\nIn addition to the information that you directly submit to us, we and our third-party service providers may use a variety of technologies that automatically collect information whenever you visit or interact with the Services (\"Usage Information\"). This Usage Information may include the browser that you are using, the URL that referred you to our Services, all the areas within our Services that you visit, and the time of day, among other information. We may use Usage Information for a variety of purposes, including to enhance or otherwise improve the Services. In addition, we collect your IP address or other unique identifier (\"Device Identifier\") for your computer, mobile or other device used to access the Services (\"Device\"). Usage Information may be non-identifying or may be associated with you. Whenever we associate Usage Information or a Device Identifier with your Personal Information, we will treat it as Personal Information.\n\nIn addition, tracking information is collected as you use our Services, including, but not limited to geolocation. If you are sending a package requested via our Services, the courier's mobile device will send your GPS coordinates, during the delivery process, to our servers. Most GPS enabled mobile devices can define one's location to within 50 feet. We collect this information for various purposes, including to determine the charge for your delivery, to provide customer support, to send promotions and offers, to enhance our Services, and for our internal business purposes.\n\nWe may also collect Usage Information using the following methods or technologies to name a few:\n\nCookies. A cookie is a data file placed on a Device when it is used to access the Services. A Flash cookie is a data file placed on a Device via the Adobe Flash plug-in that may be built-in to or downloaded by you to your Device. Cookies and Flash Cookies may be used for many purposes, including, without limitation, remembering you and your preferences and tracking your visits to our web pages. Cookies work by assigning a number to the user that has no meaning outside of the assigning website.\n\nYour browser allows you to deny or accept the use of cookies. Cookies can be disabled or controlled by setting a preference within your web browser or on your Device. However, if you disable cookies or Flash cookies on your Device, some features of the Services may not function properly or may not be able to customize the delivery of information. The Company cannot control the use of cookies (or the resulting information) by third parties, and use of third-party cookies is not covered by this Privacy Policy.\n\nWeb Beacons. Small graphic images or computer code called web beacons may be included in our web and mobile pages and messages. The web beacons are tiny graphics with a unique identifier, similar in function to cookies, and are used to track the online movements of Web users. In contrast to cookies, which are stored in a user's computer hard drive, web beacons are embedded invisibly on Web pages. Web beacons or similar technologies help us better manage content on our Services by informing us what content is effective, count users of the Services, monitor how users navigate the Services, count how many e-mails that we send were opened or to count how many particular articles or links were actually viewed. We do not tie the information gathered by web beacons to our customers' personal information.\n\nEmbedded Scripts. An embedded script is computer code that is designed to collect information about your interactions with the Services, such as the links you click on. The code is temporarily downloaded onto your Device from our web server or a third-party service provider, is active only while you are connected to the Services and is deactivated or deleted thereafter.\n\n### d. Information Third Parties Provide About You\n\nWe may, from time to time, supplement the information we collect about you through our website or Mobile Application with outside records from third parties in order to enhance our ability to serve you, to tailor our content to you and to offer you opportunities to purchase products or services that we believe may be of interest to you. We may combine the information we receive from those sources with information we collect through the Services. In those cases, we will apply this Privacy Policy to any Personal Information received, unless we have disclosed otherwise.\n\n### e. Information You Provide About a Third Party\n\nIf you choose to use our Services we will ask you for the recipient's name, phone number, delivery address and email address. We will provide this information to our courier for the purpose of providing the Services. We may also send the recipient a one-time email inviting them to visit aaadeliveryservice.com and provide promotions or an invitation to use the Services. We may store this information for the purpose of sending this one-time email, tracking the deliveries, maintaining a \"quick contact list\" for frequently used delivery recipients (this will only be accessible from your user account), and we do not use this information for any other marketing purpose unless we obtain consent from that person, or we explicitly say otherwise. Please be aware that when you enter the recipient's email address through our Services, your name, e-mail address and physical address may be included in the communication sent to the recipient.\n\n### f. Geolocation Data\n\nWith respect to geolocation data we track through Mobile Devices, we use that geolocation information for various purposes including for you to be able to set the location from which you wish your package to be picked up and delivered, to track courier progress and provide that information to you and your recipient, to send you promotions and offers, and to allow you (if you choose through any features we may provide) to share this information with other people. Except as otherwise permitted in this Privacy Policy, we will not share this information with third parties for any purpose and will only use this information for the sole purpose of providing you with the Services. You may at any time no longer allow our Services to use your location by turning this feature off at the Mobile Device level.\n\nWe also provide some of your Personal Information (such as your first name, email address, phone number and physical address) to the courier so that the courier may contact and find you. We may associate your unique Mobile Device identifier or Service usage information with any Personal Information you provide, but we will treat the combined information as Personal Information.\n\n### g. Information Collected from Couriers and Other Applicants\n\nIf you wish to apply for a job on our website, we will collect Personal Information such as your name, email address, phone number, insurance information, driver's license, social security number and may collect additional information such as resume, gender, and your ethnicity. We use the information collected within this area of the website to determine your qualifications for the position in which you have applied and to contact you to set up an interview.\n\n## 2. Use of the Collected Information\n\nWhen you register for an account with us, we will send you welcome email and promotional emails inviting you to use the Services. We will also communicate with you in response to your inquiries, to provide the Services you request, and to manage your account. We will communicate with you by email, telephone, push notification, and SMS or text message.\n\nWe use your information to understand which features of the Services are used most, to allow you to view your pickup and delivery history, store your credit card information on a secure page, view any promotions we may currently be running, rate the Services, and to otherwise improve the Services. The credit card information you provide in your personal profile at sign-up is not stored by us but is stored and used by our third-party credit card processors in order for them to process payment that you owe third parties for transportation services received by you.\n\nWe use your IP address to help diagnose problems with our computer server, and to administer our website(s). Your IP address is used to help identify you but contains no personal information about you.\n\nWe will send you transactional-related communications in connection with the Services. These communications may include but are not limited to notification that a package has been picked up or delivered, transactional summaries, maintenance notifications or other Services disruption notifications. Generally, you may not opt-out of these communications, which are not promotional in nature.\n\nIn addition, we may use your Personal Information or Usage Information that we collect about you: (1) to provide you with information or services or process transactions that you have requested or agreed to receive including to send you electronic newsletters, or to provide you with special offers or promotional materials on behalf of us or third parties; (2) to process your registration with the Services, including verifying your information is active and valid; (3) to improve the Services or our services, to customize your experience with the Services, or to serve you specific content that is most relevant to you; (4) to enable you to participate in a variety of the Services' features such as online or mobile entry sweepstakes, contests or other promotions; (5) to contact you with regard to your use of the Services and, in our discretion, changes to the Services and/or the Services' policies; (6) for internal business purposes; (7) for inclusion in our data analytics; and (8) for purposes disclosed at the time you provide your information or as otherwise set forth in this Privacy Policy.\n\n## 3.Disclosure of Information to Third Parties\n\nWe may share non-personally identifiable information, such as aggregated user statistics and log data, with third parties for industry analysis, demographic profiling, to deliver targeted advertising about other products or services, or for other business purposes. We do not sell, share, rent or trade the information we have collected about you, including Personal Information, other than as disclosed within this Privacy Policy or at the time you provide your information. We do not share your Personal Information with third parties for those third parties' direct marketing purposes unless you consent to such sharing at the time you provide your Personal Information.\n\n### a. When You Agree to Receive Information from Third Parties\n\nYou may be presented with an opportunity to receive information and marketing offers directly from third parties. If you do agree to have your Personal Information shared, your Personal Information will be disclosed to such third parties and all information you disclose will be subject to the privacy policy and practices of such third parties. We are not responsible for the privacy policies and practices of such third parties and, therefore, you should review the privacy policies and practices of such third parties prior to agreeing to receive such information from them. If you later decide that you no longer want to receive communication from a third party, you will need to contact that third party directly.\n\n### b. Third Parties Providing Services on Our Behalf.\n\nWe use third party companies and individuals to facilitate our Services, provide or perform certain aspects of the Services on our behalf. We may provide vendors with access to user information, including Personal Information, this information sharing is limited to only the information needed by the vendor to carry out the services they are performing for you or for us. Each of these vendors are obligated not to disclose or use Personal Information for any other purpose.\n\nWhile we may use third party analytics service providers to evaluate and provide us with information about the use of the Services and viewing of our content, we do not share Personal Information with these analytics service providers, but they may set and access their own cookies, web beacons and embedded scripts on your Device and they may otherwise collect or have access to information about you, including non-personally identifiable information.\n\nWe use a third-party hosting provider who hosts our support section of our website. Information collected within this section of our website is governed by our Privacy Policy.\n\n### c. Contests and Promotions\n\nWe may offer sweepstakes, contests, and other promotions (any, a \"Promotion\") through the Services that may require registration. By participating in a Promotion, you are agreeing to official rules that govern that Promotion, which may contain specific requirements of you, including, allowing the sponsor of the Promotion to use your name, voice and/or likeness in advertising or marketing associated with the Promotion. If you choose to enter a Promotion, Personal Information may be disclosed to third parties or the public in connection with the administration of such Promotion, including, in connection with winner selection, prize fulfillment, and as required by law or permitted by the Promotion's official rules, such as on a winners list.\n\n### d. Legal Reasons\n\nWe cooperate with government and law enforcement officials and private parties to enforce and comply with the law. Thus, we may access, use, preserve, transfer and disclose your information (including Personal Information), including disclosure to third parties such as government or law enforcement officials or private parties as we reasonably determine is necessary and appropriate: (i) to satisfy any applicable law, regulation, subpoenas, governmental requests or legal process; (ii) to protect and/or defend the Terms of Service for online and mobile Services or other policies applicable to any online and mobile Services, including investigation of potential violations thereof; (iii) to protect the safety, rights, property or security of AAA Delivery Service, our Services or any third party; (iv) to protect the safety of the public for any reason; (v) to detect, prevent or otherwise address fraud, security or technical issues; or (vi) to prevent or stop activity we may consider to be, or to pose a risk of being, an illegal, unethical, or legally actionable activity. Further, we may use IP address or other Device Identifiers, to identify users, and may do so in cooperation with third parties such as copyright owners, internet service providers, wireless service providers or law enforcement agencies, including disclosing such information to third parties, all in our discretion. Such disclosures may be carried out without notice to you.\n\n### e. Business Transfer\n\nWe may share your information, including your Personal Information and Usage Information with our parent, subsidiaries, and affiliates for internal reasons. We also reserve the right to disclose and transfer all such information: (i) to a subsequent owner, co-owner or operator of the Services or applicable database; or (ii) in connection with a corporate merger, consolidation, restructuring, the sale of substantially all of our membership interests and/or assets or other corporate change, including, during the course of any due diligence process.\n\n## 4. Behavioral Advertising and Opt-Out\n\nTargeted advertising (also known as Behavioral Advertising) uses information collected on an individual's web or mobile browsing behavior such as the pages they have visited or the searches they have made. This information is then used to select which advertisements should be displayed to a particular individual on websites other than our website. For example, if you have shown a preference for football while visiting our website, you may be served an advertisement for football-related equipment when you visit a site other than our website. The information collected is only linked to an anonymous cookie identifier; it does not include any information that could be linked back to a particular person, such as their name, address, or credit card number. The information used for targeted advertising either comes from us or through third party website publishers.\n\nIf you would like to opt out of targeted advertising from us that occurs when visiting our third-party advertising publishers, please click here to access the NAI Opt-Out Page. Please note that this will opt you out of targeted ads from us and any other participating advertisers. If you opt out, you may continue to receive online advertising from us; however, these ads may not be as relevant to you.\n\nIn order for behavioral advertising opt-outs to work on your Device, your browser must be set to accept cookies. If you delete cookies, buy a new Device, access our Services from a different device, login under a different screen name, or change web browsers, you will need to opt-out again. If your browser has scripting disabled, you do not need to opt out, as online behavioral advertising technology does not work when scripting is disabled. Please check your browser's security settings to validate whether scripting is active or disabled.\n\nAdditionally, many network advertising programs allow you to view and manage the interest categories they have compiled from your online browsing activities. These interest categories help determine the types of targeted advertisements you may receive. The NAI Opt-Out Page provides a tool that identifies its member companies that have cookies on your browser and provides links to those companies.\n\n## 5. Third Party Content and Links to Third Party Services\n\nThe Services may contain content that is supplied by a third party, and those third parties may collect website usage information and your Device Identifier when web pages from any online or mobile Services are served to your browser. In addition, when you are using the Services, you may be directed to other sites or applications that are operated and controlled by third parties that we do not control. We are not responsible for the privacy practices employed by any of these third parties. For example, if you click on a banner advertisement, the click may take you away from one of our websites onto a different website. These other websites may send their own cookies to you, independently collect data or solicit Personal Information and may or may not have their own published privacy policies. When you leave our website or Services, please be sure to read the privacy statements of all third-party websites or applications before submitting any Personal Information to third parties.\n\n## 6. Social Media Features\n\nOur Services may include social media features, such as the Facebook Like button, and widgets such as a \"Share This\" button, or interactive mini programs that run on our online and mobile Services. These features may collect your IP address, which page you are visiting on our online or mobile Services and may set a cookie to enable the feature to function properly. Social media features and widgets are either hosted by a third party or hosted directly on our online Services. Your interactions with these features and widgets are governed by the privacy policy of the company providing them.\n\n## 7. Changing Your Information\n\nYou are responsible for maintaining the accuracy of the information you submit to us, such as your contact information provided as part of account registration. If your Personal Information changes, or if you no longer desire our Services, you may correct, delete inaccuracies, or amend information by making the change on our member information page or by contacting us through customer support. We will make good faith efforts to make requested changes in our then active databases as soon as reasonably practicable.\n\nYou may modify your account or the communications that you have elected to receive from the Services by following the instructions contained within an e-mail or by logging into your user account and changing your communication preferences.\n\nWe will retain your Personal Information and Usage Information (including geolocation) for as long as your account with the Services is active and as needed to provide you services. We will retain your Personal Information and Usage Information (including geolocation, delivery history, credit card information and transaction history) as needed to comply with our legal and regulatory obligations, resolve disputes, conclude any activities related to cancellation of an account (such as addressing chargebacks from your credit card companies), investigate or prevent fraud and other inappropriate activity, to enforce our agreements, and for other business reason. After a period of time, your data may be anonymized and aggregated, and then may be held by us as long as necessary for us to provide our Services effectively, but our use of the anonymized data will be solely for analytic purposes.\n\n## 8. No Children\n\nOur Services are not directed toward minors, no one under 18 (and certainly no children under 13) are allowed to register with or use the Services. We do not knowingly collect Personal Information from anyone under the age of 18. If we discover that we have collected Personal Information from a person under 18, we will delete as soon as reasonably possible. If you are a parent or guardian of a minor under the age of eighteen (18) and believe he or she has disclosed Personal Information to us, please contact us at [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com)\n\n## 9. Security\n\nThe Personal Information and Usage Information we collect is securely stored within our databases, and we use standard, industry-wide, commercially reasonable security practices such as encryption, firewalls, and SSL (Secure Socket Layers) for protecting your information - such as any portions of your credit card number which we retain (we do not ourselves retain your entire credit card information) and geolocation information. However, as effective as encryption technology is, no security system is impenetrable. We cannot guarantee the security of our databases, nor can we guarantee that information you supply won't be intercepted while being transmitted to us over the Internet or wireless communication, and any information you transmit to AAA Delivery Service you do at your own risk. We recommend that you not disclose your password to anyone.\n\n## 10. Your California Privacy Rights\n\nAAA Delivery Service collects various types of personal information about you both online and offline, as described in this privacy policy. Under California law, AAA Delivery Service customers who are residents of California may request certain information about our disclosure of personal information during the prior calendar year to third parties for their direct marketing purposes. To make such a request, please write to us at the following address:\n\n8813 N Tarrant Pkwy\nSuite 236\nNorth Richland Hills, TX 76182\n\nAlternatively, you may send us an email at [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com) with the words \"California Privacy Rights\" in the subject line.\n\nAAA Delivery Service does not track its customers over time and across third party websites to provide targeted advertising and therefore does not respond to Do Not Track (DNT) signals. However, some third-party sites do keep track of your browsing activities when they serve you content, which enables them to tailor what they present to you. If you are visiting such sites, your browser may allow you to set the DNT signal on your browser so that third parties (particularly advertisers) know you do not want to be tracked.\n\nAAA Delivery Service offers interactive services which allow you to post content to share publicly. At any time, you can delete or remove content you have posted using the deletion or removal options within our services. If you have questions about how to remove content in a specific service or if you would like additional assistance with deletion, you can contact support. Although we offer deletion capability for our services, you should be aware that the removal of content may not ensure complete or comprehensive removal of that content or information posted through the services.\n\n## 11. Information Processed And Stored In The United States\n\nInformation we collect, including, Personal Information, will be processed and stored in the United States. Your Personal Information may be subject to access requests from governments, courts, or law enforcement in the United States according to laws of the United States. By using the Services or providing us with any information, you consent to the processing and storage of your information in the United States.\n\n## 12. Contact Us\n\nAAA Delivery Service, LLC.\nAttn: Privacy\n8813 N Tarrant Pkwy\nSuite 236\nNorth Richland Hills, TX 76182\n\n\nEmail: [privacy@aaadeliveryservice.com](privacy@aaadeliveryservice.com)"}},"Delivery":{"flexible-same-day-delivery.json":{"l2title2":"✅ Reliability","lmleftlink":"/industries-we-serve","r2img":"/images/home3.png","middle subtitle":"Flexible delivery gives you control over **when** your package is delivered. Whether you need it picked up now or scheduled for later, our system adapts to your timeline. Ideal for fast-moving operations and healthcare providers who rely on time-sensitive deliveries. 👉 [Speak To A Specialist](/speak-to-a-specialist)","top-image":"/images/path-map-static.png","paragraphs":[{"pgimg":{"thumbnail":"/images/home8.png","title":"Customer-Centric Support","content":"We assign a dedicated account specialist and dispatch team to your business, offering a single point of contact for all delivery operations. With professionally trained couriers and industry-certified compliance, you’re in the best hands. 👉 [Get Started Today](/speak-to-a-specialist)\n\n**“On the ground and ready — whenever you need us.”**"}},{"pgimg":{"title":"Scalable Nationwide Network","thumbnail":"/images/industries9.png","content":"With a large fleet and national coverage, we scale with your needs—without the added costs or complications of in-house fleets. Whether you're expanding across the city or the country, we're ready. 👉 [Learn More](/about-us)\n\n**“Expanding your delivery reach, without limits.”**"}},{"pgimg":{"title":"How It Works","thumbnail":"/images/industries5.png","content":"1. Contact our team and outline your delivery needs.\n2. Receive a custom solution tailored to your operations. \n3. Track every delivery in real-time through our user-friendly portal.\n4. Rely on 24/7 support and on-the-ground expertise when it matters most. 👉 [How It Works](/how-it-works)\n\n**“Tailored solutions. Transparent results.”**"}},{"pgimg":{"thumbnail":"/images/industries6.png","title":"Optimized Support, Built for Growth","content":"We go beyond basic courier services—AAA Delivery Service provides scalable, customer-first logistics designed to evolve with your business. With advanced tech tools, proactive communication, and a nationwide courier network, we ensure your delivery operations grow seamlessly without adding overhead or stress. 👉 [Speak To A Specialist](/speak-to-a-specialist)\n\n**“Behind every delivery is a team built for growth.”**"}}],"middle title2":"Advantages Of Flexible Same-Day Or \n Scheduled Delivery","lmrighttext":"Learn More","blueTopText":"# Why Choose AAA?\n\nWe are more than a courier service—we’re your logistics partner. AAA Delivery Service is built on a **“delivery always on-time, no excuses”** foundation. Our solutions are tailored, scalable, and powered by over 100 years of combined logistics experience. From pharmacies and infusion centers to laboratories and health systems, we move what matters with speed, care, and full compliance.","c2title":"📍 Tracking","c2content":"Get full visibility from pickup to destination with real-time GPS tracking and delivery updates at every step of the way.","brimage":"/images/home10.png","middle title":"What Is Flexible Same-Day Or Scheduled Delivery?","blimage":"/images/home8.png","bottomsmtext":"Same-Day Delivery. Fast. Flexible. Cost-Efficient.","blueBottomText":"### **🕒We’re Here 24/7**\n\nNo matter the hour—weekends, holidays, or last-minute needs—we’re available to keep your deliveries on track. At AAA, we don’t just move packages. **We move your mission forward.**","c2img":"/images/home2.png","lmlefttext":"Learn More","lmrightlink":"/locations","subtitle":"When time matters, trust AAA to deliver with precision and speed. We offer flexible same-day and scheduled delivery solutions tailored to your business operations. Whether you're delivering across town or statewide, we have the resources, technology, and experience to get it done—on time, every time. 👉 [Get Started With Flexible Same-Day Delivery](/speak-to-a-specialist)","r2content1":"Schedule same-day or recurring deliveries that adapt to your operations—whether it’s across town or across your entire healthcare network.","title":"Flexible Same-Day Delivery","r2content2":"Improve customer and patient satisfaction with fast, secure, and dependable deliveries—built to meet healthcare and commercial standards.","r2title1":"🔁 Flexibility","bcimage":"/images/home9.png","r2title2":"😊 Customer Satisfaction","topsmtext":"","l2img":"/images/home1.png","l2content1":"Choose your delivery times for maximum convenience—ideal for busy businesses, patients, and time-sensitive healthcare needs.","l2title1":"🕒Convenience","l2content2":"We guarantee on-time deliveries with every order—essential for critical items like infusion meds, pharmaceuticals, and medical supplies."},"overnight-delivery-services.json":{"l2title2":"Increased Efficiency","lmleftlink":"/industries-we-serve","r2img":"/images/home3.png","middle subtitle":"Our overnight shipping service ensures that customers receive their orders on the very next business day. We specialize in providing high-quality shipping services to companies during their busiest seasons, and we're committed to delivering exceptional customer service, particularly when demand is at its peak. 👉 [Learn More](/how-it-works)","top-image":"/images/path-map-static.png","paragraphs":[{"pgimg":{"thumbnail":"/images/home8.png","title":"Customer-Centric Leadership","content":"We are all about the long term, delivering value through customer focus leadership. Every day, we provide our customers with a full spectrum of quality same-day delivery services, where packages reach its destination in a fraction of time. We partner with hundreds of couriers available all over the United States to deliver fast, safely, and efficiently, regardless of where points A and B might be. 👉 [What We Offer](/what-we-offer)"}},{"pgimg":{"thumbnail":"/images/industries9.png","title":"Scalability","content":"Our national presence, alongside our massive fleet and partner carrier network, allows you to grow your business without the added stress, extra restrictions or capital expenses associated with smaller or in-house fleet. We actively apply our combined 100+ years of experiences and advanced technologies to create a custom, optimized, and cost-efficient courier model to improve your company and support growth. 👉 [Learn More](/about-us)"}},{"pgimg":{"title":"How It Works","content":"Contact us to discuss your needs, review options and provide feedback. Get your custom solutions, track your shipments and deliveries in real-time throughout the entire prosses, by gaining visibility over the shipments journey. Our team of specialists are ready to help you ramp up your operations, so you can meet the growing demands of your business, propelling your same-day capabilities forward. 👉 [How It Works](/how-it-works)","thumbnail":"/images/industries5.png"}},{"pgimg":{"thumbnail":"/images/industries6.png","title":"Get One-On-One Support","content":"We assign and provide centralized account specialists, alongside our dedicated dispatchers and fully vetted couriers, to your business. Providing your company with a single point of contact for your day-to-day delivery needs, ensuring that you receive quality, performance, and exceptional customer care. We take a fundamental approach to eliminate wasted time and deliver urgent goods right when you need them most. Providing you with quality expedited service. To learn more. 👉 [Get Started Today](/speak-to-a-specialist)"}}],"middle title2":"Advantages Of Overnight \n Delivery Services","lmrighttext":"Learn More","blueTopText":"# Why Choose AAA?\n\nWe are driven by our unwavering commitment to the 'delivery always on-time, no excuses' approach, we prioritize reliability, adaptability, and deliver customized solutions. Our relentless dedication to timeliness is complemented by our flexibility, enabling us to navigate challenges seamlessly.","c2title":"Fast Delivery","c2content":"Overnight delivery emerges as the fastest shipping solution, with its unrivaled speed and reliability, making it perfect for urgent or time-sensitive shipments.","brimage":"/images/home10.png","middle title":"What Is Overnight Delivery Services?","blimage":"/images/home8.png","bottomsmtext":"Reliable. Flexible. Scalable. Overnight, Every Night.","blueBottomText":"**🕒We are available 24/7**—any time of day, weekends, and holidays. No matter when you need us, our team is ready to ensure your deliveries are never delayed. At AAA, we don’t just deliver packages—we deliver peace of mind. Contact us today and let us redefine your logistics experience. 👉 [Register your account today](/speak-to-a-specialist)","c2img":"/images/home2.png","lmlefttext":"Learn More","lmrightlink":"/ground-transportation","subtitle":"We offer overnight courier services that assure timely delivery of your urgent shipments on the very next day. Our team of couriers and advanced technology enables us to cater to any logistics requirement with ease. In addition, our 24/7 customer service, renowned for its excellence, is always ready to support you throughout the entire process. 👉 [Speak To A Specialist](/speak-to-a-specialist)","r2content1":"The convenience of overnight delivery means you can send and receive items quickly, reliably, and effortlessly, without the hassle of extensive planning or waiting.","title":"Overnight Delivery Services","r2content2":"Offering overnight/next-day delivery as a shipping option can give businesses a strategic competitive advantage, as it can help them stand out from their competitors and attract more customers.","r2title1":"Convenience","bcimage":"/images/home9.png","r2title2":"Competitive Advantage","topsmtext":"","l2img":"/images/home1.png","l2content1":"Overnight/next-day delivery services come with guaranteed delivery times, giving you peace of mind that your package will arrive when you need it to.","l2title1":"Reliability","l2content2":"Overnight shipping option can help businesses increase efficiency by allowing them to quickly deliver products to customers and minimize delays in their supply chain."},"scheduled-route-delivery-services.json":{"l2title2":"Cost-Effectiveness","lmleftlink":"/industries-we-serve","r2img":"/images/home3.png","middle subtitle":"A Scheduled Route Delivery Service transports packages along set routes at regular intervals. Ideal for recurring pickups and deliveries, this solution improves efficiency and reduces costs through route and schedule optimization. 👉 [Learn More](/how-it-works)","top-image":"/images/path-map-static.png","paragraphs":[{"pgimg":{"thumbnail":"/images/home8.png","title":"Customer-Centric Leadership","content":"We’re committed to long-term partnerships, delivering value through customer-focused leadership and dependable service. Every day, we provide a full range of same-day delivery solutions. With hundreds of couriers across the nation, your packages reach their destination quickly, safely, and efficiently—no matter the distance. 👉 [What We Offer](/what-we-offer)"}},{"pgimg":{"thumbnail":"/images/industries9.png","title":"Scalability","content":"Our national presence—alongside our massive fleet and trusted carrier network—empowers your business to scale without added stress or capital investment. With over 100 years of combined experience and innovative tech, we deliver optimized, cost-efficient courier models that support your growth. 👉 [Learn More](/locations)"}},{"pgimg":{"thumbnail":"/images/industries5.png","title":"Time-Critical Specialists","content":"AAA specializes in time-sensitive route delivery, ensuring your packages are moved swiftly and accurately from Point A to Point B. We serve key industries including healthcare, at-home services, and freight logistics. 👉 [Learn More](/industries-we-serve)"}},{"pgimg":{"title":"Get One-on-One Support","thumbnail":"/images/industries6.png","content":"We assign a centralized account specialist to your business—backed by experienced dispatchers and fully vetted couriers—giving you a dedicated point of contact for all delivery needs. Our proactive approach reduces delays and ensures your scheduled deliveries are handled with precision and care. 👉 [Get Started Today](/speak-to-a-specialist)"}}],"middle title2":"Advantages Of Scheduled Route \n Delivery Services","lmrighttext":"Learn More","blueTopText":"# Why Choose AAA?\n\nGuided by our **\"on-time, no excuses\"** philosophy, we deliver reliability, adaptability, and tailored delivery solutions built specifically for the healthcare industry. Whether it’s daily clinic pickups, lab specimen transport, or recurring medical supply deliveries, our team understands the urgency and precision required. With AAA, you're not just choosing a courier—you’re choosing a healthcare logistics partner committed to protecting patient outcomes through speed, safety, and accountability.","c2title":"Reliability","c2content":"Scheduled route delivery ensures that packages will be delivered at the agreed upon time, which can improve customer satisfaction.","brimage":"/images/home10.png","middle title":"What Is Scheduled Route Delivery Service?","blimage":"/images/home8.png","bottomsmtext":"Built for Routine. Backed by Reliability. Defined by Flexibility.","blueBottomText":"**🕒**We are available 24/7—any time of day, weekends, and holidays. No matter when you need us, our team is ready to ensure your deliveries are never delayed. At AAA, we don’t just deliver packages—we deliver peace of mind.  Contact us today and let's redefine your medical logistics experience. 👉 [Speak To A Specialist](/speak-to-a-specialist)","c2img":"/images/home2.png","lmlefttext":"Learn More","lmrightlink":"/locations","subtitle":"Dependable. Consistent. Efficient. AAA’s Scheduled Route Delivery Services are your trusted solution for routine deliveries along pre-planned routes—designed for consistency, convenience, and peace of mind. 👉 [Get Started](/speak-to-a-specialist)","r2content1":"Scheduling routes in advance allows for the optimization of routes and schedules, which can result in more efficient and cost-effective deliveries.","title":"Scheduled Route Delivery Services","r2content2":"Customer satisfaction is elevated through route delivery, which guarantees the timely and reliable delivery of packages.","r2title1":"Efficiency","bcimage":"/images/home9.png","r2title2":"Customer Satisfaction","topsmtext":"","l2img":"/images/home1.png","l2content1":"Our scheduled route delivery services offer the flexibility to customize routes and schedules to meet the specific needs of your business.​","l2title1":"Flexibility","l2content2":"Optimizing scheduled route delivery services offer a cost-effective solution tailored for businesses handling high volumes of deliveries."},"stat-delivery-service.json":{"l2title2":"Flexibility","lmleftlink":"/healthcare","r2img":"/images/home3.png","middle subtitle":"STAT delivery is a 24/7, time-sensitive courier service designed to transport critical items such as lab specimens, blood samples, and essential medical equipment. It’s built for urgency—ensuring rapid, secure delivery with zero compromise. 👉 [Explore Your Dashboard](/speak-to-a-specialist)","top-image":"/images/path-map-static.png","paragraphs":[{"pgimg":{"title":"Customer-Centric Leadership","content":"We take a long-term approach—building lasting partnerships through customer-focused leadership. Our network of experienced couriers spans the U.S., ensuring that packages arrive fast, safe, and on time. From local runs to cross-regional STAT deliveries, we deliver in a fraction of the time. 👉 [Start Tracking Your First Delivery](/speak-to-a-specialist)","thumbnail":"/images/home8.png"}},{"pgimg":{"title":"Scalability","thumbnail":"/images/industries9.png","content":"With a nationwide presence and a robust courier network, AAA empowers you to grow without added costs or constraints. We combine over 100 years of industry experience with modern technology to create custom courier models that improve efficiency and reduce operational burden. 👉 [Learn More](/locations)"}},{"pgimg":{"title":"Time-Critical Delivery Experts","content":"AAA specializes in rapid, precise movement of critical items from Point A to Point B. With expertise spanning healthcare, home care, and freight logistics, our teams are built for urgency. When every minute counts, we deliver. 👉 [Learn More](/what-we-offer)","thumbnail":"/images/industries5.png"}},{"pgimg":{"title":"One-on-One Dedicated Support","content":"We assign a centralized account specialist—backed by experienced dispatchers and fully vetted couriers—giving your business a single point of contact for all delivery operations. Our streamlined approach eliminates wasted time and ensures your deliveries arrive exactly when they’re needed. 👉 [Connect With Our Delivery Experts](/speak-to-a-specialist)","thumbnail":"/images/industries6.png"}}],"middle title2":"Advantages Of Stat Delivery \n Service","lmrighttext":"Learn More","blueTopText":"# Why Choose AAA for Stat Deliveries?\n\nWe operate by a single principle: *On-Time Delivery. No Excuses.* Our focus is reliability, adaptability, and delivering tailored solutions to meet your most time-critical needs. We seamlessly navigate challenges to ensure your package arrives—no matter the circumstances.","c2title":"Reliability","c2content":"STAT delivery services are very reliable, as they prioritize speed and efficiency in order to get packages to their destination as quickly as possible.","brimage":"/images/home10.png","middle title":"What Is Stat Delivery Service?","blimage":"/images/home8.png","bottomsmtext":"STAT Means Now — We Deliver Without Delay.","blueBottomText":"**🕒Always On. Always Ready.** Available 24/7—including weekends and holidays—AAA ensures your deliveries are never delayed. We don’t just move packages; we deliver peace of mind. 👉 [Contact Us Today](/speak-to-a-specialist) and let’s redefine your STAT delivery experience.","c2img":"/images/home2.png","lmlefttext":"Learn More","lmrightlink":"/industries-we-serve","subtitle":"At AAA, we provide swift, reliable STAT delivery solutions tailored to your urgent needs. Whether it’s lab specimens, medical equipment, or critical documents—your time-sensitive items are delivered *Guaranteed On-Time. No Excuses.* We prioritize speed, safety, and consistency. 👉 [Register Your Account Today](/speak-to-a-specialist)","r2content1":"STAT delivery is often more convenient for customers, as it allows them to receive their packages faster than with standard delivery options.","title":"Stat Delivery Service","r2content2":"Stat delivery services significantly contribute to enhancing customer satisfaction by consistently ensuring the timely and reliable delivery of packages.","r2title1":"Convenience","bcimage":"/images/home9.png","r2title2":"Customer Satisfaction","topsmtext":"","l2img":"/images/home1.png","l2content1":"The primary STAT delivery benefit is the unmatched speed at which packages and other items are delivered—crucial in emergencies or critical care situations.","l2title1":"Speed","l2content2":"STAT delivery services provide various options—like one-hour or same-day delivery—enabling customers to select their preferred delivery speed and schedule."}},"footer":{"footerLayout.json":{"main_description":"In the world of logistics, where most situations require timeliness, AAA is a must-have option to stay ahead of the competition.","our_services":[{"label":"Home","url":"/"},{"label":"What we offer","url":"/what-we-offer"},{"label":"How it works","url":"/how-it-works"},{"label":"Industries","url":"/industries-we-serve"},{"label":"Our locations","url":"/locations"}],"industries":[{"label":"Healthcare","url":"/healthcare"},{"label":"Freight","url":"/ground-transportation"},{"label":"At Home","url":"/at-home"}],"our_company":[{"label":"About Us","url":"/about-us"},{"label":"Careers","url":"#"},{"label":"Drive for us","url":"#"},{"label":"Carriers","url":"/carriers"},{"label":"Our locations","url":"/locations"}],"contact_us":[{"label":"Speak to a Specialist","url":"/speak-to-a-specialist"},{"label":"info@aaadeliveryservice.com","url":"mailto:info@aaadeliveryservice.com"},{"label":"1844 AAA-0206","url":"tel:1844 AAA-0206"},{"label":"2101 Terminal Road\nFort Worth, Texas 76106","url":"#"}],"copyright_text":"Copyright 2025 AAA Delivery Service. All Rights Reserved.","privacy_policy_link":"/privacy","sms_terms_link":"/sms-terms"},"order-tracking-in-real-time.json":{"title":"Real-Time Order Tracking","p1":"Track every shipment with GPS visibility on a live map. Receive real-time ETA updates, automatic alerts via text or email, and Proof of Delivery (POD) with actual delivery time.","title2":"Transparency & Visibility","p2":"We build transparency into every shipment. Our technology keeps your delivery data at your fingertips, so you stay informed throughout the entire logistics process.","tvideo":"/images/map.mp4"}},"Freight":{"ground-transportation.json":{"r2img":"/images/industries3.png","top-image":"/images/home7.png","paragraphs":[{"pgimg":{"title":"Specialized Network","content":"We combine a powerful fleet, vetted couriers, and cutting-edge technology to meet your logistics needs with precision and efficiency. Whether you're shipping same-day, expedited, or LTL, we ensure **real-time tracking, transparency, and accountability** across every shipment.","thumbnail":"/images/head1.png"}},{"pgimg":{"title":"Reliable Partners","content":"We blend smart technology with a trusted carrier network to simplify freight movement and give you peace of mind. With AAA, you're partnering with a team that’s **built for today’s demands** and ready to scale with you as your needs grow.","thumbnail":"/images/head6.png"}},{"pgimg":{"title":"✅Technology That Moves You Forward","content":"Our fully integrated logistics platform includes:\n\n* Real-time driver tracking and geofencing\n* Barcode scanning and digital signature/photo POD\n* Detailed audit trails and delivery lifecycle records\n* API / EDI integrations for seamless connectivity\n* Automated alerts, ETAs, and order confirmations\n* Web portal for self-serve order placement and tracking\n\n**Get full control, visibility, and performance insights—all in one place.**","thumbnail":"/images/head5.png"}},{"pgimg":{"title":"✅Online Portal","content":"Our easy-to-use portal allows you to:\n\n* Schedule pickups with accurate ETAs\n* Track orders in real time from any device\n* View PODs with signatures or photos\n* Access detailed reporting and order history\n* Ensure delivery accuracy with auto-verified addresses\n* Track invoices and individual pieces with reference numbers\n\n**Everything you need—organized, trackable, and at your fingertips.**","thumbnail":"/images/head4.png"}}],"blueTopText":"AAA handles urgent, time-sensitive shipments with precision. Backed by a massive fleet and nationwide partner network, we deliver mission-critical freight [across all 48 states](/locations)—on time, every time.","c2title":"Warehouse Shipping","brimage":"/images/industries3.png","blimage":"/images/home8.png","bottomsmtext":"Ground Transportation That Goes the Distance—With Precision You Can Trust.","blueBottomText":"## 24/7 Availability\n\nWe’re always on—day or night, weekends, and holidays. No matter the time or urgency, AAA is ready to move. **We don’t just deliver packages—we deliver peace of mind.** 📞 [Contact us today](/speak-to-a-specialist) and redefine your logistics experience.","c2img":"/images/home3.png","subtitle":"**Built for the Road. Backed by Safety. Driven by Transparency.**\n\nWe provide fast, flexible, and secure ground transportation services—tailored to meet your business’s delivery needs. From same-day and expedited shipments to less-than-truckload (LTL) solutions, AAA offers **end-to-end visibility** and **reliable execution** for every mile.","title":"Ground \n Transportation","r2title1":"Ground Transportation","bcimage":"/images/ground5.png","topsmtext":"⚡Time Critical Specialists","l2img":"/images/ground1.png","l2title1":"Door-To-Door Delivery"}},"Healthcare":{"healthcare-courier-services.json":{"middle-title":"Healthcare Businesses We Serve","middleTitle":"Healthcare Partners We Proudly Serve","r2img":"/images/speak3.png","top-image":"/images/healthcare.jpg","paragraphs":[{"pgimg":{"thumbnail":"/images/image1.png","title":"Decades of Experience","content":"Since 1995, AAA Delivery Service has earned the trust of healthcare providers across the region. With over 25 years of expertise, we’ve grown alongside the healthcare industry, adapting to its evolving needs with precision, care, and innovation.\n\nFrom small practices to major health systems, our reputation is built on reliability, compliance, and service excellence. We don’t just deliver — we partner with you to elevate your logistics and empower better outcomes. 👉 [Experience The AAA Difference Today](/speak-to-a-specialist)"}},{"pgimg":{"thumbnail":"/images/home7.png","title":"Delivery Options Built for Healthcare","content":"Choose from a range of delivery solutions designed to meet your exact needs. Whether it’s STAT service, same-day delivery, overnight service, or scheduled routes, we offer the flexibility and reliability to keep your operations running smoothly.\n\nOur goal: optimize your logistics, improve efficiency, and make sure your critical items always arrive on time. 👉 [Explore Our Delivery Options](/what-we-offer)"}},{"pgimg":{"title":"Reliable & Efficient — Every Time","content":"Our “always on time, no excuses” philosophy sets us apart. Every delivery is handled with urgency and care, ensuring your critical items arrive securely, on time, and in perfect condition.\n\nFrom STAT specimen pickups to scheduled routes across town, our uniformed couriers follow strict handling protocols using bio-coolers, barcode scanning, and GPS tracking — providing full visibility and peace of mind at every step. 👉 [Count On AAA For Logistics You Can Trust—Every Time](/speak-to-a-specialist)","thumbnail":"/images/twitter-post-photo-collage-1-1-.png"}},{"pgimg":{"thumbnail":"/images/industries9.png","title":"Proven Cost Savings","content":"Through intelligent routing and data-driven optimization, our clients typically reduce courier costs by 10–30%. We analyze your current logistics model, identify inefficiencies, and implement smarter strategies that lower expenses and improve performance.\n\nThe result: fewer delays, better outcomes, and a stronger bottom line. 👉 [Let’s Unlock Your Savings Potential](/speak-to-a-specialist)"}}],"blueTopText":"# Seamless Healthcare Integration\n\nYour patients depend on precision — and so do we. AAA Delivery Service specializes in last-mile healthcare logistics, delivering critical items with unmatched speed, security, and accuracy. From specimens and pharmaceuticals to medical supplies and equipment, our services are designed to integrate seamlessly into your workflows — ensuring every delivery supports patient care and operational efficiency.","c2title":"","brimage":"/images/home10.png","paragraphs2":[{"pgimg":{"thumbnail":"/images/healthcare5.png","title":"Hospitals & Health Systems","content":"Mission-critical deliveries, tailored to your clinical workflow — specimens, devices, imaging materials, prescriptions, and equipment.\n\nOur HIPAA-compliant, OSHA-certified couriers are equipped with GPS tracking, barcode scanners, spill kits, and biohazard-labeled coolers to maintain safety and chain of custody at every step.\n\n**Operationally seamless. Clinically essential.** 👉 [Talk To A Healthcare Logistics Specialist](/what-we-offer)"}},{"pgimg":{"title":"Medical Laboratories","content":"We handle the time-sensitive transport of clinical specimens with precision and compliance. Whether ambient, refrigerated, or frozen, our couriers preserve specimen integrity from pickup to delivery.\n\nEvery courier is certified in HIPAA and OSHA protocols, with tools like GPS tracking, barcode scanning, and biohazard-labeled coolers for complete traceability. **Secure. Certified. Always on time.** 👉 [See How We Serve Medical Labs](/stat-delivery-services)","thumbnail":"/images/healthcare4.png"}},{"pgimg":{"title":"Infusion Centers","content":"We provide tailored logistics solutions for infusion centers that prioritize safety, precision, and speed. Our trained couriers handle time-sensitive specimens, infusion medications, and medical supplies with strict adherence to healthcare protocols.\n\n## Climate-Controlled & Scalable\n\nFrom across town to across your network, we offer temperature-regulated transport using a scalable fleet—ranging from compact cars to box trucks—to meet your center’s specific demands. 👉 [Learn More About Infusion Center Deliveries](/flexible-delivery)","thumbnail":"/images/iv_circles.png"}},{"pgimg":{"title":"Pharmacy Companies","content":"We specialize in pharmacy deliveries that prioritize patient care, compliance, and speed. Our on-demand and scheduled routes are built to streamline pharmacy operations—enhancing delivery accuracy and reducing turnaround times.\n\nFrom local prescriptions to large-scale distribution, AAA ensures secure, same-day transport with full traceability—supporting better outcomes for your patients and your business. 👉 [Explore Our Pharmacy Delivery Solutions](/what-we-offer)","thumbnail":"/images/healthcare6.png"}},{"pgimg":{"thumbnail":"/images/lab_circles.png","title":"Medical Supply Companies","content":"We deliver critical medical supplies with speed, care, and accountability. Whether it’s surgical tools, durable medical equipment (DME), or time-sensitive shipments, AAA ensures safe, secure transport—every time.\n\nTrusted by hospitals, clinics, and suppliers nationwide, our trained couriers follow strict protocols, use climate-controlled vehicles, and provide real-time tracking—so you can count on reliable deliveries that protect patients and support care teams. 👉 [Explore Medical Supply Delivery Solutions](/what-we-offer)"}},{"pgimg":{"thumbnail":"/images/blood_bag2.png","title":"Blood Centers","content":"We provide specialized delivery services for blood centers—ensuring the safe, rapid transport of blood products, plasma, and related specimens. Our climate-controlled vehicles and trained couriers maintain strict temperature integrity and chain of custody throughout the journey.\n\nFrom small-volume pickups to high-capacity transports, we scale with your needs and operate with urgency, precision, and compliance—because lives depend on it. 👉 [Discover Blood Center Logistics With AAA](/what-we-offer)"}}],"blueWhiteMiddleText":"**Industries & Services We Specialize In**\n\nOur advanced same-day transportation integrates seamlessly with your logistics infrastructure. Whether you need secure specimen transport, custom delivery routes, or time-critical pharmaceutical deliveries, we deliver unmatched reliability, flexibility, and support. Our solutions are built to simplify operations and maximize productivity — so you can stay focused on what matters most: patient care.","blimage":"/images/home8.png","bottomsmtext":"Delivering with Precision — Because Lives Depend on It.","blueBottomText":"### **🕒Always Here. Always Ready.**\n\nWe’re here for you—24/7, including weekends and holidays. Whether it’s a scheduled route or a last-minute STAT request, our team is ready to deliver—without delay, without exception. At AAA Delivery Service, we don’t just move packages—we move healthcare forward. 📞 [Contact us today.](/speak-to-a-specialist)Let’s redefine your healthcare logistics experience.","c2img":"/images/healthcare2.png","blueWhiteMiddleTitle":"Advantages Of Partnering With AAA​ \n Delivery Service​","subtitle":"We proudly connect patients, providers, and pharmacies through secure, compliant, same-day deliveries—ensuring better care, faster turnaround times, and smoother operations. 👉 [Speak With a Healthcare Logistics Expert](/speak-to-a-specialist)","title":"Market Leader in Healthcare Same-Day Logistics","r2title1":"","bcimage":"/images/home9.png","topsmtext":"> [Medical Laboratories](#medical-laboratories) | [Hospitals & Health Systems](#hospitals-&-health-systems) | [Infusion Centers](#infusion-centers) | [Pharmacies](#pharmacy-companies) | [Medical Supply Companies](#medical-supply-companies) | [Blood Centers](#blood-centers)[](#blood-centers)","l2img":"/images/speak1.png","l2title1":""}},"home":{"reliable-same-day-delivery-courier-service.json":{"lmleftlink":"/healthcare","l2sbtitle":"AAA connects the healthcare ecosystem with innovative logistics solutions, delivering critical medical materials swiftly, securely, and accurately—with pinpoint precision—to enhance patient care.","middleTitle":"","r2img":"/images/home3.png","middle subtitle":"Every business is unique—and in today’s fast-paced world, needs can shift by the minute. That’s why we provide tailored logistics solutions that adapt in real time, ensuring your deliveries stay on track, no matter what.","paragraphs":[{"pgimg":{"thumbnail":"/images/home8.png","content":"* Reliability, Experience, Efficiency, and Accountability\n* On-Demand, Same-Day Door-to-Door Delivery\n* Real-Time Order Tracking & Geofencing Dashboard\n* 24/7 Customer Support\n* Guaranteed On-Time Delivery — No Excuses","title":"Our Core Advantages"}},{"pgimg":{"content":"* Fully Vetted, Uniformed Professional Couriers\n* Custom Logistics Tailored to Your Business\n* Full Transparency and Real-Time Visibility\n* Delivery Status Notifications via Text or Email\n* On-Time, Reliable Service — Every Time","thumbnail":null,"title":"Our Operational Excellence"}},{"pgimg":{"thumbnail":"/images/home6.png","title":"One-On-One Support","content":"We assign a dedicated account specialist to your business—your single point of contact, backed by centralized dispatchers and trusted couriers. This ensures consistent performance and seamless communication every day. Our goal is to eliminate downtime and ensure your urgent goods arrive exactly when needed—giving you true peace of mind. 👉 [Get Started With a Dedicated Specialist](/speak-to-a-specialist)"}},{"pgimg":{"thumbnail":"/images/home10.png","title":"Adapting To Your Business","content":"Need to expand or supplement your fleet? AAA is ready. Our logistics specialists will quickly scale your operations, control costs, and maximize efficiency. As an extension of your team, we deliver customized solutions designed for growth, flexibility, and success. 👉 [How It Works](/how-it-works)"}}],"lmrighttext":"Learn More","blueTopText":"### <center>We don’t just promise — we deliver.</center>\n\nWith experienced couriers, a vast fleet, and cutting-edge technology, AAA provides [unmatched nationwide logistics support.](/locations) Backed by a legacy of excellence and a forward-thinking approach, we deliver results you can count on — with speed, precision, and accountability at every step of the way. Here’s what we offer:","r2sbtitle":"Trust AAA to power your logistics. Whether handling fast-moving demands or planning for future growth, we deliver unmatched expertise, innovation, and dedication to keep your shipments on track.","c2title":"Ground Transportation","c2content":"","brimage":"/images/image1.png","middle title":" Guaranteed On-Time Delivery. Custom Logistics. Shipping Nationwide.","blimage":"/images/dispatch-left.png","bottomsmtext":"Moving Healthcare Forward, One Delivery at a Time.","l2title":"Moving Healthcare Forward","l2content":"**<center>Swift and Secure</center>**\n\n<center>We specialize in the fast, secure, and precise delivery of vital specimens, critical pharmaceuticals, and essential medical supplies. With AAA, your items arrive safely and reliably—on time, every time.</center>","c2img":"/images/home2.png","lmlefttext":"Learn More","lmrightlink":"/industries-we-serve","subtitle":"From life-saving medical deliveries to mission-critical freight, AAA delivers with precision, urgency, and care—coast to coast, door to door.","r2title":"Empowering Your Shipments","bottomtext":"### **🕒Always Here. Always Ready.**\n\nAvailable 24/7—weekdays, weekends, and holidays. Whether it's a routine route or an urgent STAT request, our team is always prepared. At AAA, we don’t just deliver packages—we deliver peace of mind. 👉 **[Contact us today](/speak-to-a-specialist)** and experience logistics without limits.","title":"Moving Our Nation Forward & Delivering What Matters","r2content":"**<center>Unmatched Reliability</center>**\n\n<center>We consistently exceed expectations with every delivery. Your shipments are handled with care, urgency, and professionalism—and they arrive safely, exactly when promised. No delays, no excuses.</center>","bcimage":"/images/home9.png","c2sbtitle":"Leveraging advanced technology and a reliable network of carriers, we move your packages efficiently and securely—whether across the city or nationwide, with flexibility to meet your unique logistics needs.","video":"/images/aaa-2-1080p-221014.mp4","topsmtext":" Why AAA Stands Out Above The Rest","l2img":"/images/home1.png"}},"HowItWorks":{"how-it-works.json":{"top-video":"/images/aaa-3-1080p-221015.mp4","middle subtitle":"Put the power of AAA behind every delivery—built for today’s demands and ready for tomorrow’s challenges. We streamline your logistics operations so you can stay focused on what matters most: your business.","top-image":"/images/aaa-logo2.png","paragraphs":[{"pgimg":{"thumbnail":"/images/image1.png","title":"Professional, Vetted Couriers—Every Time","content":"Our thoroughly vetted couriers uphold the highest standards of professionalism. From wearing uniforms and ID badges to operating marked vehicles, we ensure trust and reliability at every step. You’ll receive real-time confirmations for both pickup and delivery—and enjoy reliable, on-time service with no excuses. 👉 [Register your account today](/speak-to-a-specialist)"}},{"pgimg":{"thumbnail":"/animated-svg-circle-map","title":"Real-Time Tracking and Instant Updates","content":"Enjoy full visibility throughout the entire delivery process with real-time GPS tracking and live map views. Automatic updates via text or email keeps you informed at every step. You'll always have access to proof of delivery (POD) and verified delivery times—for added peace of mind. 👉 [Explore your dashboard](/speak-to-a-specialist)"}},{"pgimg":{"thumbnail":"/images/image2.png","title":"Smart Customizations with API Integration","content":"Take full control with API integrations, advanced order tracking, auto-verified addresses, and detailed invoice references. Customize POD preferences (signature or photo), include notes, and receive confirmations in the way that works best for your business. 👉 [Start tracking your first delivery](/speak-to-a-specialist)"}},{"pgimg":{"title":"Rate Your Experience","thumbnail":"/images/image3.png","content":"We value your feedback. As we continue to lead in healthcare logistics, your input helps us deliver smarter, more customized solutions. We’re always improving—because you deserve the best. 👉 [Get Started Today](/speak-to-a-specialist)"}}],"blueTopText":"Our online portal provides a seamless, user-friendly experience—allowing you to easily schedule, personalize, and monitor pickups from any device, all in one place. You'll receive accurate arrival times, delivery confirmations, and signature or photo-verified proof of delivery for every order—plus real-time tracking data at your fingertips.","brimage":"/images/ground5.png","middle title":"Start Here","blimage":"/images/dispatch-left.png","bottomsmtext":"Transparent. Trackable. Trusted. That’s the AAA Way.","blueBottomText":"**🕒Always Available—24/7/365.** We’re here whenever you need us—day or night, weekends or holidays. Whether it’s a scheduled delivery or a last-minute STAT, our team ensures your deliveries are never delayed. At AAA, we don’t just deliver packages—we deliver peace of mind. **👉** [Contact us today and let us redefine your logistics experience](/speak-to-a-specialist)","subtitle":"Streamline Every Step—From Pickup to Proof of Delivery","title":"How It Works","bcimage":"/images/home9.png","topsmtext":"Schedule And Customize A Delivery"}},"Industries":{"industries-we-serve.json":{"r2img":"/images/industries3.png","top-video":"/images/1.industries_we_serve.mp4","paragraphs":[{"pgimg":{"content":"Our team is fully vetted and trained for excellence. Each courier is certified in HIPAA, TSA, OSHA, and FMCSA regulations—ensuring your deliveries are handled with care and compliance. 👉 [What We Offer](/what-we-offer)","title":"Certified, Professional Couriers","thumbnail":"/images/ground1.png"}},{"pgimg":{"content":"We don’t miss deadlines. With local experts on the ground and real-time courier ratings, we ensure punctual, responsive service—every time. 👉 [Learn More](/about-us)","title":"Timeliness With Accountability","thumbnail":"/images/industries9.png"}},{"pgimg":{"title":"Secure, Confidential Handling","content":"From sensitive documents to medical equipment, we protect your privacy. Our advanced protocols and tracking systems ensure secure handling from pickup to its final delivery destination. 👉 [How It Works](/how-it-works)","thumbnail":"/animated-svg-circle-map"}},{"pgimg":{"title":"Get One-On-One Support","content":"We assign centralized account specialists, supported by dedicated dispatchers and fully vetted couriers. Your business gets a single point of contact for daily delivery needs—ensuring consistent performance and outstanding care. We eliminate wasted time and deliver urgent goods when you need them most—providing peace of mind. 👉 [Get Started Today](/speak-to-a-specialist)","thumbnail":"/images/industries6.png"}}],"blueTopText":"We understand the unique demands of each industry we serve, ensuring precision and speed in every delivery. Whether it’s healthcare essentials, cherished home items, or vital freight, our commitment lies in secure, swift, and specialized service tailored to your needs. We deliver with precision and excellence—every time.","c2link":"/healthcare","c2title":"🩺Healthcare","brimage":"/images/home10.png","paragraphs2":[{"pgimg":{"thumbnail":"/images/image.png","content":"We streamline healthcare logistics with tailored delivery solutions that prioritize precision and compliance. From temperature-sensitive meds to medical equipment, we ensure secure, on-time delivery backed by 24/7 support. 👉 [Learn More](/healthcare)","title":"🩺Healthcare"}},{"pgimg":{"title":"📦Freight","thumbnail":"/images/home3.png","content":"At AAA, we bring you unmatched freight efficiency through our specialized logistics solutions. Our cost-effective strategies and dedicated support team are available around the clock to fulfill all your cargo transportation needs. 👉 [Learn More](/ground-transportation)"}},{"pgimg":{"title":"🏠At Home","thumbnail":"/images/image-1-.png","content":"Experience the convenience of 'At Home Deliveries.' We bring your essentials right to your doorstep with a dedicated approach and 24/7 customer support—ensuring you get what you need, precisely when you need it. 👉 [Learn More](/at-home)"}},{"pgimg":{"title":"⏱️Time-Critical Specialists","content":"At AAA, we pride ourselves on being time-critical specialists—professionals who excel in the swift and accurate movement of goods from Point A to Point B. With relentless urgency, we manage high-priority deliveries across Healthcare, At Home, and Freight. 👉 [Learn More](/how-it-works)\n\n**Across every sector, we’re not just fast—we’re dependable, compliant, and built for your success.**","thumbnail":"/images/image1.png"}}],"middle title":"⏱️Time Critical Specialists","blueWhiteMiddleText":"Partnering with AAA means more than just delivery—it’s gaining a reliable logistics ally that goes the extra mile. From certified couriers to personalized support, we tailor every detail to your business’s success.","l2link1":"/at-home","blimage":"/images/home8.png","bottomsmtext":"Guaranteed On-Time Delivery. No Exceptions. No Excuses.","blueBottomText":"**Always On. Always Reliable.** We’re available 24/7—weekends, holidays, and emergencies. When others are off the clock, AAA is on the move. Ready to experience logistics without limits?[Contact AAA today—where your delivery is always our priority.](/speak-to-a-specialist)","c2img":"/images/home1.png","blueWhiteMiddleTitle":"Why Choose AAA?","r2link1":"/ground-transportation","subtitle":"We give your business a competitive edge through cost-effective, under-two-hour delivery solutions. Our platform blends same-day logistics, next-level customer experience, and innovative technology to help you thrive—across every industry we serve.","title":"Specialized Delivery \n Across Industries","r2title1":"📦Freight ","bcimage":"/images/home9.png","topsmtext":"Delivering to Diverse Sectors","l2img":"/images/home2.png","l2title1":"🏠At Home "}},"Locations":{"we-are-currently-serving-all-48-states-nationwide.json":{"l2title2":"Reliable and Efficient","lmleftlink":"/speak-to-a-specialist","r2img":"/images/home3.png","lmrighttext":"Speak To A Specialist","pTitle":"Scalability","c2title":"Cost Saving","c2content":"Leveraging our experience and customized routing software, we help our customers save 10-30% on courier costs. Through a comprehensive evaluation of your existing courier system and data analysis, we identify opportunities to optimize and reduce expenses.","image-right":"/images/industries9.png","content 2":"We actively apply our combined 100+ years of experiences and advanced technologies to create a custom, optimized, and cost-efficient courier model to improve your company and support growth. 👉 [Start Building Your Custom Delivery Solution](/speak-to-a-specialist)","brimage":"/images/home10.png","middle title":"Advantages Of Partnering With AAA \n Delivery Service","blimage":"/images/home8.png","bottomsmtext":"Built for Speed. Driven by Care. Powered by Experience.","blueBottomText":"## **<center>Availability. Reliability. Peace of Mind.</center>**\n\n⏱️AAA is available 24/7—including weekends and holidays—because your deliveries can’t wait. Whether it’s a critical medical specimen or essential equipment, we make sure it arrives when and where it’s needed.","c2img":"/images/home2.png","lmlefttext":"Speak To A Specialist","lmrightlink":"/speak-to-a-specialist","r2content1":"Choose from a range of delivery options that meet your business needs. From stat delivery to flexible same-day, overnight, and scheduled route deliveries, we provide the flexibility to meet your customers' demands while streamlining your logistics processes.","title":"We are currently serving all 48 states nationwide.","content":"Our national presence, alongside our massive fleet and partner carrier network, allows you to grow your business without the added stress, extra restrictions or capital expenses associated with smaller or in-house fleet.","r2content2":"Enhance your customer service with AAA Delivery Service. Our real-time tracking and delivery notifications keep your customers informed every step of the way, minimizing missed deliveries and boosting overall satisfaction.","image-left":"/images/industries9.3cd45f02d28a8c649500-2-.png","r2title1":"Flexible Delivery Options","bcimage":"/images/home9.png","r2title2":"Improved Customer Service","l2img":"/images/home1.png","l2content1":"With years of experience in optimizing medical courier systems for laboratories, hospitals, and healthcare providers, AAA Delivery Service is your trusted partner in streamlining logistics processes and improving delivery performance.","l2title1":"Experience","l2content2":"Count on AAA Delivery Service for reliable and efficient delivery services. Our commitment to timeliness and accuracy ensures your products are delivered on time and in excellent condition, enhancing customer satisfaction and loyalty."}},"Logistics":{"exceptional-logistics-lasting-value-aaas-commitment-to-communities-and-customers.json":{"l2title2":"Customer Focus","l2content3":"Our dedicated team of couriers and staff are vetted professionals, ensuring a high standard of service and care for your deliveries.","l2title3":"Professionalism","r2img":"/images/twitter-post-photo-collage-1-1-.png","bottomContent1":"At AAA, we're not just delivering packages; we're delivering peace of mind. Partner with us and let your logistics worries become our responsibility. Whether you need secure medical deliveries, tailored solutions, or streamlined operations, we've got you covered.","paragraphImage1":"/images/industries9.png","bottomContent2":"[Request a Quote:](/speak-to-a-specialist) Curious about how much you can save on courier costs? Reach out for a personalized quote and discover the unmatched value AAA Delivery Service can offer your business.","founders":[{"pgimg":{"name":"Roger Sepulveda","job":"Founder & Chief Executive Officer","image":"/images/1.roger.png"}},{"pgimg":{"name":"Melody Reyna","job":"Chief Financial Officer","image":"/images/2.melody-r-s.png"}},{"pgimg":{"name":"Julian Voss","job":"Chief Technology Officer","image":"/images/3.julian-voss.png"}},{"pgimg":{"name":"Jordan Kingcaid","job":"Chief Marketing Officer","image":"/images/4.jordan.png"}},{"pgimg":{"name":"Oshdan Myles","job":"Director Of Marketing","image":"/images/5.oshdan.png"}},{"pgimg":{"name":"Leticia Gonzalez","job":"Director Of People Operations","image":"/images/6.lety.png"}},{"pgimg":{"name":"Ponciano Gonzalez","job":"Director Of Supply Chain Operations","image":"/images/7.ponciano.png"}},{"pgimg":{"name":"Joshua Sepulveda","job":"Director Of Logistics","image":"/images/8.josh.png"}}],"bottomTitle1":"Ready to Experience Exceptional Delivery Services?","paragraphImage2":"/images/industries9.png","bottomTitle2":"Get Started Today:","paragraphContent1":"Founded in 1995 as AC Express, we embarked on a journey fueled by a vision for unparalleled delivery service. Over the years, our dedication to fast, efficient, and reliable deliveries earned us a reputation as a reputable service provider in the Dallas-Fort Worth metroplex, Austin, San Antonio, and Houston.","paragraphContent2":"In the pursuit of excellence, we rebranded ourselves as AAA Delivery Service, embodying three core principles: Customer Obsession, People-Led, and Innovation-Driven.","paragraphTitle1":"Our History \n \n From AC Express to AAA Delivery Service","c2content2":"We embrace cutting-edge technology and innovative solutions to provide you with the best delivery experience possible.","paragraphContent3":"Driven by our core values of Integrity, Leadership, Commitment, Excellence, Safety, and Professionalism, our mission is to deliver exceptional logistics solutions that drive competitive advantages and sustained value for our customers.\n\nWe aim to be indispensable to our customers by providing unparalleled peace of mind and freeing them to focus on their core businesses. Through our unwavering commitment to these values, we continually strive to exceed expectations, ensuring reliability, adaptability, and customized solutions tailored to our customers' unique needs.","blueTopText":"Partnering with AAA Delivery Service means partnering with a reliable, customer-focused, and technologically advanced logistics provider. Your deliveries are in good hands with us, allowing you to focus on what matters most - your core business.","paragraphTitle2":"Transformation and Commitment","topsmtitle":"Our Executive Team","c2title2":"Innovation","c2title":"Efficiency","paragraphTitle3":"Our Mission, Vision, and Values","c2content":"With our advanced logistics solutions, we streamline the delivery process, making it quick, easy, and hassle-free.","middleContent2":"At AAA, our advanced same-day transportation integrates seamlessly with your logistics network. From secure medical deliveries to tailored solutions, providing unwavering reliability, flexibility, and robust support. Our services are designed to empower your lab's productivity, ensuring streamlined operations and efficient healthcare logistics management.","middleTitle2":"Advantages Of Partnering With AAA \n Delivery Service","topStep1":"Customer Obsession!| Cultivating Creativity!","paragraphContent1hidden":"At AAA, our customers are at the heart of everything we do. We obsess over understanding their needs, and providing reliable, adaptable, and customized delivery solutions. Through our relentless commitment to customer satisfaction, we measure our success by the improvements in our net promoter score.","paragraphTitle1hidden":"Customer Obsession","topStep2":"People-Led,| Nurturing Talent!","paragraphContent2hidden":"Our success is not just about deliveries; it’s about our people. We foster a culture where our employees, drivers, and sub-contractors bring their energy to work. This People-Led approach ensures our clients receive service that goes beyond their expectations.","bottomsmtext":"","paragraphContent3hidden":"At AAA Delivery Service, we believe that doing the right thing is not just a responsibility — it’s who we are. We hold ourselves to the highest standards of ethics, compliance, and professionalism in every delivery we make.\n\nIntegrity is at the heart of everything we do. It guides our decisions, builds trust with our clients and partners, and strengthens our mission to support the healthcare community.\n\nOur Code of Conduct empowers our team to act with transparency, respect, and accountability. We are committed to earning the trust of every customer and creating a workplace where excellence and ethical behavior are the foundation of success.\n\nAt AAA Delivery Service, integrity isn’t just a value — it’s the way we deliver every day.\n\n## Our Quality Policy\n\nWe are committed to excellence in everything we do. That means:\n\n* Delighting our customers\n* Maintaining the highest standards\n* Investing in continuous education and training for our team\n* Consistently delivering with accuracy, safety, and care","topStep3":"Innovation-Driven,| Beyond Satisfaction!","paragraphTitle2hidden":"People-Led: and Innovation-Driven","paragraphContent4hidden":"Your satisfaction is our top priority. We focus on:\n\n* Reliability\n* On-time deliveries\n* Tailored transportation solutions\n* Cost savings of 10–30% within our coverage area\n\n**Join us on this journey. Experience delivery services redefined at AAA.**","topStep4":"Quality Commitment,| Exceeding Standards!","paragraphTitle3hidden":"Our Commitment to Integrity","c2img":"/images/home10.png","paragraphTitle4hidden":"Our Objective","r2content1":"Our services are tailored to meet your specific requirements, offering a range of delivery options to suit your business needs.","title":"Exceptional Logistics, Lasting Value!  AAA's Commitment to Communities and Customers","r2content2":"We help you save on courier costs without compromising on service quality, allowing your business to thrive.","r2title1":"Flexibility","r2content3":"Our round-the-clock support ensures you have assistance whenever you need it, even on weekends and holidays.","r2title2":"Cost-Effectiveness","bottomStep1":"Save Money,| On Courier Costs!","r2title3":"24/7 Availability","bottomStep2":"Discover The| Unmatched Value!","topsmtext":"Partnering with AAA Delivery Service means partnering with a reliable, customer-focused, and technologically advanced logistics provider. Your deliveries are in good hands with us, allowing you to focus on what matters most - your core business.","bottomStep3":"Reach Out,| Speak To A Specialist!","l2img":"/images/home7.png","bottomStep4":"Contact Us Today,| Request A Quote!","l2content1":"we are committed to on-time deliveries, ensuring your packages reach their destination safely and promptly.","l2title1":"Reliability","l2content2":"Our customer-centric approach means your needs are our top priority. We go the extra mile to ensure your satisfaction."}},"same-day-delivery":{"at-home-same-day-delivery.json":{"paragraphs":[{"pgimg":{"title":"Dedicated Team","content":"Our specialists and certified couriers are ready to scale with your business. Whether you need to extend your fleet or meet growing same-day demand, we step in fast—with experience, urgency, and precision. 👉 **[Meet Your Delivery Team](/about-us)**","thumbnail":"/images/head1.png"}},{"pgimg":{"title":"Certified Couriers","content":"AAA couriers meet FMCSA, TSA, HIPAA, and OSHA compliance standards. Equipped with barcode scanners, mobile devices, GPS, and ID badges, they handle your cargo with care and professionalism.","thumbnail":"/images/head2.png"}},{"pgimg":{"content":"Our fully integrated logistics platform includes:\n\n* Real-time driver tracking and geofencing\n* Barcode scanning and digital signature/photo POD\n* Audit trails and lifecycle records\n* API / EDI integrations for seamless system syncing\n* Automated alerts, ETAs, and confirmations\n* Web portal for real-time management\n\n**Stay in control with full visibility—every step of the way.**","title":"Technology That Moves You Forward","thumbnail":"/images/head3.png"}},{"pgimg":{"title":"Online Portal","thumbnail":"/images/head4.png","content":"Our easy-to-use portal lets you:\n\n* Schedule pickups with accurate ETAs\n* Track orders from any device\n* View signature/photo-based PODs\n* Access reporting, notes, and delivery history\n* Auto-verify addresses and track invoices\n* Save time with centralized order and customer management\n\n**Everything your business needs—centralized, trackable, and easy to manage.**"}}],"blueTopText":"Why Choose AAA?","brimage":"/images/home10.png","blimage":"/images/home8.png","bottomsmtext":"Healthcare Delivered to Your Door—Fast, Reliable, Compliant","blueBottomText":"### 🕒 Always On. Always Ready.\n\nWe're here 24/7—including nights, weekends, and holidays. Whether it’s scheduled or last-minute, AAA is ready to deliver. We don’t just deliver packages—we deliver peace of mind. 📞 [Contact us today](/speak-to-a-specialist) and let’s redefine your logistics experience.","title":"At Home Same-Day Delivery","bcimage":"/images/dispatch-right.png","paragraphs top":[{"paragraphs-with-image-top":{"title":"At Home Same-Day Delivery","thumbnail":"/images/same-day1.png","content":"**Local Speed. Nationwide Reach. Built for Small & Mid-Size Businesses.**\n\nAAA provides fast, affordable, and flexible same-day delivery—ensuring your business saves time, reduces costs, and exceeds customer expectations. From across town to across the country, our door-to-door service gives you a competitive edge."}},{"paragraphs-with-image-top":{"title":"🚚On-Demand Delivery","thumbnail":"/images/home2.png","content":"Rely on AAA for faster, safer, and always-on-time delivery. Our same-day courier solutions improve inter-office efficiency while reducing cost and complexity. Place and track orders from one platform—so you stay in control and your deliveries stay on schedule. 👉 [Learn More](/what-we-offer)"}},{"paragraphs-with-image-top":{"thumbnail":"/images/same-day3.png","title":"🕒Get Same-Day Local Delivery","content":"We work with small and mid-size businesses to deliver goods same-day—across town or across the country. Whether you need a primary logistics partner or a backup solution, AAA offers flexibility and cost-efficiency that supports both your customers and your bottom line. 👉 [See How It Works](/how-it-works)"}},{"paragraphs-with-image-top":{"title":"📞Get One-On-One Support","content":"We assign a dedicated account specialist, dispatcher, and vetted courier team to your business—giving you a single point of contact for all delivery operations. This personalized approach eliminates wasted time and ensures quality service, every time. 👉 [Register Today](/speak-to-a-specialist)","thumbnail":"/images/same-day1.png"}}]}},"sms-terms":{"sms-terms.json":{"title":"SMS Terms","subtitle":"AAA Delivery Service – SMS Terms","p1":"","p2":"**Program**: AAA Dispatch Alerts\n**Last Updated**: November 2025\n\n\nAAA Delivery Service, LLC (“AAA Delivery Service,” “we,” “our,” or “us”) provides text message communications (“SMS”) strictly for **internal operational purposes**. These messages are sent **only to employees and independent contractor drivers** who have provided consent during the onboarding or application process.\n\n## **Message Purpose**\n\nMessages are used solely for company operations, including but not limited to:\n\n* Route assignments and scheduling updates\n* Delivery confirmations and troubleshooting\n* Safety notifications and dispatch coordination\n  No marketing or promotional text messages are sent to the public.\n\n## **Message Frequency**\n\nMessage frequency varies depending on operational needs, delivery volume, and driver schedule.\n\n## **Cost**\n\nStandard message and data rates may apply based on your mobile carrier plan.\n\n## **Opt-Out Instructions**\n\nYou may opt out of AAA Delivery Service SMS communications at any time by replying **STOP** to any message. You will receive one final confirmation message acknowledging your opt-out request.\n\n## **Help Instructions**\n\nFor assistance, reply **HELP** to any AAA Delivery Service message, or contact us directly at:\n**✉️ [privacy@aaadeliveryservice.com](mailto:privacy@aaadeliveryservice.com)\n☎️[ (844) 222-0206](tel:+18442220206)**\n\n## **Privacy and Data**\n\nAAA Delivery Service respects your privacy. Personal information collected for SMS communication is **never sold or shared with third parties** for marketing purposes.\nText message opt-ins are **excluded from any information sharing**.\nFor more details, please review our [Privacy Policy](https://aaadeliveryservice.com/privacy).\n\n## **Carriers Disclaimer**\n\nWireless carriers are not liable for delayed or undelivered messages.\n\n## **Eligibility**\n\nThis SMS program is intended exclusively for AAA Delivery Service employees and independent contractor drivers aged 18 or older.\n\n**AAA Delivery Service, LLC**\n[8813 N Tarrant Pkwy, Suite 236\nNorth Richland Hills, TX 76182](https://www.google.com/maps/place/8813+N+Tarrant+Pkwy+%23236,+North+Richland+Hills,+TX+76182,+USA/@32.9053543,-97.1989105,771m/data=!3m2!1e3!4b1!4m5!3m4!1s0x864dd668a143021b:0xa6419ffe14be8c58!8m2!3d32.9053543!4d-97.1963356?entry=ttu&g_ep=EgoyMDI1MTEwOS4wIKXMDSoASAFQAw%3D%3D)\n\n\n✉️ **[privacy@aaadeliveryservice.com](mailto:privacy@aaadeliveryservice.com)**"}},"speak-to-a-specialist":{"ready-to-speak-to-a-specialist.json":{"bluevideo":"/images/4.things_you_can_do_from_our_portal.mp4","s3TopText":"AAA is more than a delivery service; we are a business enabler dedicated to your success. Our primary objectives are customer satisfaction, reliability, and on-time deliveries. With our custom one-to-one approach, we ensure timely deliveries every time. We strive to become your trusted business partner, delivering what matters most to you. Here’s what we offer:","top-image":"/images/aaadeliveryservice-final-v2.mp4","blueTitleLeft":"Medical Laboratories","s4bluetoptext":"We are available 24/7—any time of day, weekends, and holidays. No matter when you need us, our team is ready to ensure your deliveries are never delayed. At AAA, we don’t just deliver packages—we deliver peace of mind. [Contact us today](/speak-to-a-specialist) and let's redefine your medical logistics experience.","blueTopText":"As soon as you're in our system, you're ready to go. Easily schedule and track orders from any device, anytime. Gain full visibility with real-time tracking, custom alerts, and delivery confirmations — all from one central dashboard.","brimage":"/images/speak3.png","blimage":"/images/speak1.png","bottomsmtext":"Talk to a Specialist. Get a Solution. No Excuses.","blueTitleCenter":"Hospitals & Health Systems","s3c2img":"/images/home7.png","subtitle":"Please provide us with some basic information so we can learn more about your business delivery requirements, so our logistics specialists can craft a solution tailored to your unique delivery needs.\n\n\n\n\nPlease fill out the form on the right with the requested information. One of our logistics specialists will review your information and contact you shortly to discuss the next steps and answer any questions you may have.","s3BottomText":"# Delivering Peace of Mind with AAA\n\nOur mission is to provide unmatched reliability, professionalism, and peace of mind with every delivery. We handle your logistics with precision and care, so you can focus on what matters most—your core business. With AAA, your deliveries are always in trusted hands.","title":"Ready To Speak To A Specialist?","s3r2content1":"* Flexible Solutions That Adapt to Your Business\n* Peace of Mind, Every Mile — Backed by Reliable, Consistent Service\n* HIPAA, OSHA, TSA & FMCSA Compliant & Certified\n* Customizable Notifications and Delivery Preferences\n* User-Friendly Online Portal with Full Visibility and Control","bcimage":"/images/home1.png","topsmtext":"What You Can Expect From Us","s3topsmtext":"Why Choose AAA?","s3l2content1":"* Guaranteed On-Time Delivery — No Excuses\n* Same-Day, On-Demand, and Scheduled Route Services\n* Professionally trained, uniformed, and fully vetted couriers\n* 24/7 Customer Support — Weekends & Holidays Included\n* Real-Time GPS Tracking & Transparent Communication","blueTitle":"   What You Can Do in the Portal:","blueTitleRight":"Pharmacies","blueContent":"1. Manage medical deliveries from a secure portal\n2. Schedule pickups with custom instructions\n3. Track vital shipments with live GPS updates\n4. View photo or signature-based PODs\n5. Get real-time delivery status notifications\n6. Monitor temperature-sensitive shipments\n7. Ensure compliance with chain-of-custody tracking\n8. Access reports on delivery history and trends"}},"WhatWeOffer":{"hello-world.json":{"l2sbtitle":"Reliability","r2img":"/images/home3.png","middle subtitle":"Business needs can shift by the day—or by the minute. That’s why AAA Delivery Service provides indispensable, custom-tailored logistics that flex and adapt to your specific operational demands. With us, you gain a reliable partner and lasting peace of mind.","paragraphs":[{"pgimg":{"title":"Augment Your Fleet","thumbnail":"/images/home8.png","content":"Need to scale fast? AAA offers on-demand support and same-day assistance. We’ll act as an extension of your business—ready to deliver when and where needed. 👉 [Learn More](/how-it-works)"}},{"pgimg":{"thumbnail":"/images/home10.png","title":"Supplement Your Fleet","content":"Looking to augment or replace your current operations? We bring the expertise, couriers, and technology to keep you ahead. Gain instant access to live tracking, POD, and streamlined operations. 👉 [Get Started](/speak-to-a-specialist)"}},{"pgimg":{"thumbnail":"/images/image6.png","title":"Simplify Scheduling — On-Demand or Recurring","content":"Our easy-to-use online portal gives you full control—whether you're placing a one-time order or managing recurring routes. Enjoy upfront pricing, accurate ETAs, real-time tracking, and instant delivery confirmations tailored to your preferences. 👉 [Register Here](/speak-to-a-specialist)"}},{"pgimg":{"thumbnail":"/images/image7.png","title":"Adapting To Your Business","content":"Our systems are designed to flex with your needs, giving you total visibility and control over every delivery—without the overhead. Save time, cut costs, and increase productivity with AAA by your side. 👉 [Get Started Today](/speak-to-a-specialist)[](http://localhost:3000/speak-to-a-specialist)"}}],"blueTopText":"At AAA, we offer a range of same-day delivery solutions tailored to businesses of all sizes. Our services include STAT Delivery, Overnight Delivery, Scheduled Route Delivery, and Flexible Same-Day Delivery. AAA is your reliable unwavering partner in managing logistics efficiently.","r2sbtitle":"Transparency","c2title":"At Home","brimage":"/images/home10.png","paragraphs2":[{"pgimg":{"thumbnail":"/images/twitter-post-photo-collage-1-1-.png","title":"Stat Delivery","content":"When time is critical, our STAT service ensures packages are delivered with speed and care. Every STAT delivery is handled with urgency and precision. 👉 [Learn More](/stat-delivery-services)"}},{"pgimg":{"thumbnail":"/images/same-day3.png","title":"Overnight Delivery","content":"Need it there by morning? Our overnight courier service ensures next-day delivery with accuracy and speed—supported by 24/7 customer service. 👉 [](/overnight-deliveries)[Learn More](/overnight-deliveries)"}},{"pgimg":{"thumbnail":"/images/ground1.png","title":"Scheduled Route Delivery","content":"Reliable, recurring deliveries made easy. Set your schedule, and we’ll handle the rest—on time, every time. Manage everything through our intuitive online portal. 👉 [Learn More](/schedule-delivery)[](/schedule-delivery)"}},{"pgimg":{"thumbnail":"/images/image1.png","title":"Flexible Same-Day Delivery","content":"No matter the urgency, we deliver with precision and care. we offer same-day delivery with flexible timing to meet your exact requirements. 👉 [Learn More](/flexible-delivery)"}}],"middle title":"Custom Logistics-Indispensable Courier Services","blueWhiteMiddleText":"Owning and managing a fleet is costly and time-consuming. Partner with AAA and let us handle the logistics. We reduce expenses, minimize risk, and improve your internal workflow—so you can focus on what matters most.","blimage":"/images/home8.png","bottomsmtext":"Propelling Healthcare Forward — Every Mile, Every Time.","l2title":"Healthcare Logistics","blueBottomText":"**We're Here 24/7—Always Ready, Always Reliable.** No matter the hour—weekends, holidays, or last-minute emergencies—we’re available to ensure your deliveries stay on track. At AAA, we don’t just deliver packages—we deliver peace of mind. **[Contact us today](/speak-to-a-specialist)** and let us redefine your logistics experience.","l2content":"* Dependable, fully-vetted couriers you can trust\n* Seamless API integrations to streamline every order\n* Customized delivery options for your unique workflows\n* Guaranteed on-time delivery — no excuses\n* Unmatched quality assurance and customer satisfaction","c2img":"/images/home2.png","blueWhiteMiddleTitle":"Fleet Optimization — Cut Costs, Boost Productivity","subtitle":"\n Whether it's urgent or routine, we've got you covered","r2title":"Freight & Commercial","title":"Complete Delivery Services, All from One Reliable Partner","r2content":"* Live GPS tracking from pickup to delivery\n* Full transparency and shipment visibility\n* Tailored logistics solutions that grow with your business\n* Fully FMCSA, TSA, HIPAA compliant and OSHA certified\n* Around-the-clock customer support","bcimage":"/images/home9.png","c2sbtitle":"Availability","video":"/images/aaa-2-1080p-221014.mp4","topsmtext":"Instant Delivery Solutions","l2img":"/images/home1.png"}}}